{
  "exported_at": "2026-02-25T23:23:22.609580",
  "stories": [
    {
      "id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "user_id": "d5e48591-0c7a-45ef-8b49-97201759bbb3",
      "name": "Multex",
      "description": "",
      "detected_languages": [],
      "status": "active",
      "created_at": "2026-02-25T17:31:37.838354+00:00",
      "updated_at": "2026-02-25T19:10:38.295539+00:00"
    },
    {
      "id": "06ec1b89-b1fe-4fca-8d27-4c97621dd838",
      "user_id": "d5e48591-0c7a-45ef-8b49-97201759bbb3",
      "name": "Малтекс",
      "description": "",
      "created_at": "2026-02-25T21:49:02.393926+00:00",
      "updated_at": "2026-02-25T21:49:02.393926+00:00",
      "source_story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "source_language": "mixed",
      "translated_to": "Russian"
    }
  ],
  "chapters": [
    {
      "id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "name": "Pre-history, K&S Software. Building the multilingual Software",
      "order": 0,
      "content_blocks": [
        {
          "type": "text",
          "content": "### Chapter — 1981: The First PC (Final)\n\nI came to the United States in May of 1980. By then I was working at Golding Industries—my second job in America—doing software development for a textile manufacturing company. The computer I lived inside every day was an IBM mainframe running CICS, an online transaction system that handled everything the business did in real time.\n\nOne task in particular stayed with me.\n\nGolding had a manufacturing plant in South Carolina, and they needed invoices printed there—remotely—without someone manually handling tapes or paper in New York. Today that sounds ordinary. Back then it wasn’t. The system didn’t really “support” programming a remote printer the way you’d expect. So I did what you did in those days: I went down to the metal. I wrote a utility at the machine-code level and made it work.\n\nI was proud of it. But I also couldn’t forget how hard it had been just to do something so basic—send words to paper.\n\nEven before I left the USSR, I’d heard rumors of a new kind of technology while listening to Voice of America: *personal computers.* Small enough to sit on a desk. Affordable enough—supposedly—that a person could own one. The idea lodged in my head like a splinter: a real computer that belonged to you.\n\nBy the fall of 1981 my wife and I had been working for close to a year. We weren’t making much by American standards, but we had something we hadn’t had before: stability. We lived in a rented apartment in Brooklyn with almost no furniture—just necessities. But compared to what we’d left behind, it felt like freedom.\n\nAnd that’s when I remembered my promise to myself: I was going to get a PC.\n\nThe popular machines then were the Apple II and the TRS-80. IBM had announced its PC, but nobody yet knew it would become *the* standard. I chose it anyway. I was working on IBM systems every day, and I believed—almost instinctively—in IBM’s gravity. If I was going to buy a computer with my own money, it had to be an IBM PC.\n\nThe problem was the price.\n\nMy system had 64KB of memory. For storage it had two floppy drives, 320KB each. And a dot-matrix printer that—if I remember correctly—printed at about 10 characters per second. By today’s standards it’s almost comical. The Mac I’m writing this story on has 32GB of memory—32,000,000,000 bytes compared to 64,000.\n\nBut in 1981 it was a full-blown computer. A programmable machine. A world.\n\nThe cost was over $5,000 at the IBM retail store when they opened in New York—over $14,000 in today’s money. My annual salary was around $24,000. I had been in the country barely a year. We had no real savings. Still, I was determined.\n\nSo I went to a bank for a personal loan.\n\nThey said no—at least, not without a guarantor. My credit history was too short. If someone with strong credit co-signed, they would do it.\n\nI asked a man named Mody Zeidman.\n\nMody lived in our neighborhood. He volunteered as an English teacher at our synagogue. He was a lawyer—a native New Yorker—with everything I didn’t yet have: a long history in this country, a stable reputation, and the kind of confidence that comes with belonging. At the time I didn’t fully understand what I was asking. In my mind it was just paperwork.\n\nIn America, it was trust.\n\nMody agreed without hesitation.\n\nWith Mody’s signature, the bank gave me a $6,000 loan. I went to the IBM store and brought home my computer. I still remember setting it up on the only table we owned.\n\n(There’s a photo from that day. I’m half naked because it was summer, hot, and we didn’t have an air conditioner yet. But we had a computer.)\n\nOnce everything was connected and powered up, I started to learn the machine the way I always learned machines: by taking it apart with code.\n\nThe software was primitive. There wasn’t even a real text editor—just a line editor. You edited one line at a time. For programming you had BASIC and, if you were brave, assembler for Intel’s 8088.\n\nI decided my first project would be a full-screen text editor, like the one I used on the IBM mainframe at work.\n\nIt was harder than I expected. But while building it I realized something that would later become the heart of everything: if I controlled the screen and the keyboard mapping, I didn’t have to stop at English. With some creativity, I could make it write in Russian—or any alphabet I understood. And I could make it go not only left to right, but right to left.\n\nMy best friend, Gera Ginzburg, was living in Israel then. He had left the USSR almost a year before me. When I told him what I was building, he immediately said: “Make it support Hebrew. Make it write right to left.”\n\nHe was right. And once the idea was spoken out loud, there was no going back.\n\nI brought in Gera in Israel and Igor Saxonov in Brooklyn—someone I’d been introduced to—and the three of us worked nights. We kept pushing the editor until it became something bigger: a multilingual word processor.\n\nWithin a year, we had a product that felt unusual for the early IBM PC market.\n\nAnd then we hit a new problem.\n\nWe had built it.\n\nBut we had absolutely no idea what to do with it. In the USSR we didn’t know how to start a business. In America, we were about to find out—fast.\n\n---\n\n### Early Days of Marketing a PC Product\n\nOnce we had a multilingual word processor that actually worked, we ran straight into a problem that had nothing to do with software.\n\nWe didn’t know how to sell it.\n\nOf the three of us, Igor was the most entrepreneurial. He didn’t have a “network” in the American sense of the word—none of us did—but he had initiative and a kind of fearless curiosity. He started calling people, asking questions, turning small connections into meetings. Friends of friends. Acquaintances from the neighborhood. Anyone who might know someone who owned a computer store or knew a businessman who was “in computers.”\n\nThat’s how we began to get introduced to the early PC world in Brooklyn—small storefronts, cramped back offices, people learning the business as they went along. We’d bring disks, do demonstrations, talk too much, and listen carefully. Sometimes we were taken seriously. Sometimes we weren’t. Sometimes we were sure we were in the middle of a real business conversation, only to realize later that we were speaking different languages—not Russian and English, but “engineering” and “sales.”\n\nThrough this meager chain of introductions, we eventually found our way to the Want brothers and their store in downtown Brooklyn. In those days, a computer store wasn’t a sleek showroom—it was more like a workshop with a cash register. Boxes stacked to the ceiling, machines in various states of assembly, printers chattering in the background, customers asking basic questions that today would seem unbelievable. The Want brothers were practical people. They understood customers. They understood what sold. And they understood immediately that what we had—especially the ability to handle multiple alphabets, and right-to-left—wasn’t just a technical trick. For the right buyer, it was a market.\n\nOne introduction led to another. Without going into some details that were, in hindsight, almost hilarious, we stumbled into a man who decided he would build a software company around our product.\n\nHe wasn’t a programmer. He wasn’t even from the PC world. He was a sophisticated businessman—a commodities trader—who saw the opportunity before he understood the mechanics. And he was about to learn, the hard way, that early PC software wasn’t like commodities. You couldn’t treat it as a thing you bought and sold and expected to behave by itself. It needed engineering. It needed support. It needed constant improvement.\n\nBut in one crucial respect, he was serious: he wanted to buy the product outright.\n\n---\n\n### Selling the Product — “Lock, Stock and Barrel”\n\nBy then, Mody Zeidman had become more than the man who co-signed my bank loan. He was the one American in our orbit who could translate this new world for us: contracts, leverage, negotiation, the quiet power of simply knowing how business is done here.\n\nMody helped us negotiate and represented us through what became a surprisingly convoluted, protracted process. There were terms, conditions, drafts, revisions, and the kind of back-and-forth that feels less like logic and more like endurance—especially when you’re new to the country and still learning how to read between the lines.\n\nIn the end we agreed on a deal that, even now, still feels unreal when I say it out loud.\n\nThe buyer formed a company specifically for our product and purchased it—and all rights to it—*lock, stock and barrel* for **$600,000**.\n\nOnly because of Mody’s help did we get what I believe was a very strong price for that time. We signed the papers and walked away from our creation somewhat stunned by the size of the number. For three recent emigrants who had started from scratch, it didn’t just feel like a business transaction. It felt like proof that we could build something valuable in America.\n\nTo close the loop on the word processor: the new company and product were named **World Master**. Apparently, it eventually went public—I suspect on the AIM market, but I’m not sure. What I do know is that it never made the progress it could have, because it didn’t have software engineering support. The man who bought it didn’t engage us to keep developing it. Without the people who understood the code, the product couldn’t evolve the way the market demanded. In time, the company folded.\n\nSo our first product didn’t become a long-term commercial success.\n\nBut for us personally, it changed everything.\n\nWe were equal partners, and each of us walked away with **$200,000**. By then it was **January 1986**—in today’s value, that would be over **$560,000** each. A meaningful amount of money by any standard. For three recent emigrants, it felt enormous.\n\nWe felt rich. And in the USSR we didn’t know how to start a business. In America, we were about to find out—fast.",
          "file_id": null,
          "url": null,
          "caption": null
        }
      ],
      "detected_languages": [],
      "created_at": "2026-02-25T17:38:27.637178+00:00",
      "updated_at": "2026-02-25T19:10:38.295539+00:00"
    },
    {
      "id": "4afc2093-d155-4771-86bb-43695788bcd1",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "name": "Multex I, Goldman Sachs and the impetus for Multex I",
      "order": 1,
      "content_blocks": [
        {
          "type": "text",
          "content": "Here’s a tightened, more narrative version of your “Multex I / Goldman Sachs impetus” section, keeping your voice but improving flow, clarity, and stakes. I’ve also lightly corrected names/grammar (you can revert any detail to match your memory).\n\n---\n\n## Multex I — Goldman Sachs and the impetus\n\nNights belonged to my word processor. Days belonged to corporate America.\n\nEven after Golding Industries, I stayed on the “day job” track, but something had changed. Building that word processor had rewired my brain. I wasn’t just learning how software worked—I was learning how opportunity worked. And as PCs started creeping into serious corporate environments, I found myself pulled into advanced technology groups: the teams inside big companies whose job was to figure out what to do with this new, chaotic thing called the personal computer.\n\nBy January of 1986 I was at Goldman Sachs in IT, overseeing an R&D group focused on PC implementation across the firm. Goldman wasn’t a place that experimented casually. Everything had to justify itself. But that was exactly what made it exciting: we were trying to take a tool that had been designed for individuals and force it to become something corporate—secure, supportable, scalable, and useful to people who cared about speed and numbers.\n\nSomewhere in the middle of all that, the idea that I might start my own software business stopped feeling like a fantasy. It started feeling like an inevitability.\n\nThe opportunity arrived through a familiar voice from my past.\n\nMy old boss from Equitable Insurance—Dolores Bailey—reached out. She had moved into a role leading corporate R&D, focused on adopting and implementing new technology across Equitable, and she asked if I could help in a consulting capacity.\n\nI said yes immediately. Not just because it sounded interesting, but because I recognized what it really was: a door.\n\nConsulting meant I could do what I already knew how to do—build—and get paid for it, without asking anyone’s permission. It was the cleanest bridge between “corporate employee” and “entrepreneur” that I could imagine.\n\n---\n\n## Founding Multex Systems (Multex I) and early clients\n\nIn April of 1986, I left Goldman and began consulting with Dolores’s R&D group at Equitable. The work grew quickly—enough that it didn’t make sense to do it alone. I brought in three former Goldman colleagues: John Mahoney, George Baird, and Van Negris.\n\nTogether, we formed Multex Systems.\n\nI was the founding partner and majority shareholder, but the company was built as a true team effort from day one. We immediately started delivering multiple projects for Equitable—practical PC and early Windows development work that big organizations wanted, but didn’t yet have the internal muscle to execute consistently.\n\nI also gave Mody equity in Multex Systems. At the time it was partly appreciation for his role in the word processor sale, but it turned out to be more than that. Mody had a way of thinking about “exit strategy” before most people even admitted exits existed. When the time came again, that mindset proved important.\n\nAnd this is probably the best moment to explain the name: **Multex**.\n\nYears earlier, while naming the word processor, someone had tossed out an abbreviation for “multilingual text”—*mul-tex*. We never used it then, but it stuck in my head like a brand waiting for its product. When it came time to name the company, I pulled it off the shelf.\n\nMultex Systems—Multex I—was primarily a consulting firm: custom development projects for PC and Windows environments. Our first major clients were Equitable and Goldman—both former employers—where friends and colleagues pulled us back in for specific projects.\n\nThe company gradually grew to around 30 employees, mostly developers working across different client engagements. But something else was happening alongside the consulting revenue: we were accumulating reusable expertise—internal tools, libraries, patterns, and shortcuts that made us faster every month.\n\nWithout fully realizing it at the time, we were inching toward product.\n\nOne of those internal efforts became a small product we called **Multex Quote**.\n\n---\n\n## Microsoft, Excel, and the birth of Multex Quote\n\nMultex Quote started almost accidentally—because Microsoft needed a story.\n\nMicrosoft was preparing a major announcement of a new product called **Excel**, and in New York they planned to stage different “themes” showing how Excel could be used in real businesses. One of the themes was **Wall Street**.\n\nBut for “Wall Street” to look real, Excel needed something it didn’t have out of the box: live market data.\n\nMicrosoft needed a working demonstration—fast—and the number of developers who understood both Excel and real-time financial data was small. Somehow our name came up, and we got the call: could we build a quick app that pumped real-time quotes into Excel and made it look like Excel could run a real-time portfolio?\n\nJohn and George pulled a full all-nighter. It was absolutely a prototype—hacked together, rushed, not something you’d ship to a client—but it worked. It fed live prices into Excel, and the spreadsheet models updated in real time.\n\nOn a large monitor, it looked like the future.\n\n---\n\n## The Excel announcement and the moment the room leaned in\n\nThe setup was theatrical: a large room staged as “Wall Street,” a PC running Excel on a big screen, with prices ticking live—powered by our overnight prototype.\n\nExecutives from financial firms wandered over, drawn in by the motion of real-time data and the implication behind it: *if this works, we can build anything on top of it.*\n\nOne of the people who stopped was from Fidelity Investments: **Jim Stoddard**, who oversaw technology development for Fidelity’s advisor network. He didn’t admire it as a gimmick. He looked at it as a distribution mechanism.\n\nHe asked a simple question: *How can I buy this for my users?*\n\nWe explained the truth—this was only a prototype, and to make it robust enough for real use would require serious development.\n\nJim offered us a deal we couldn’t refuse.\n\nFidelity would fund the development. In exchange, Fidelity advisors would be allowed to use it at no cost. And crucially, once it was complete, **we would retain the rights** to the product.\n\nIt was a rare kind of corporate agreement: a major institution paying to turn a prototype into a product—while letting the small company keep the upside.\n\nWe agreed.\n\nOver roughly six months we built a real, working product: a system that linked market quotes into Excel models in real time, giving users a way to build and run portfolio analytics directly inside a spreadsheet.\n\n---\n\n## Commercial distribution through Microsoft\n\nThen we got another break.\n\nSomeone at Microsoft—likely the same person who’d originally contacted us—heard what the Fidelity-funded prototype had become. Microsoft offered us a promotional opportunity that would have been impossible for a small firm to buy outright.\n\nWe printed brochures for Multex Quote explaining how it fed quotes into Excel using Microsoft’s real-time data interchange technology called **DDE**. We shipped stacks of brochures to Microsoft’s production facility. Microsoft inserted one into every Excel package shipped to customers.\n\nFor the cost of printing, we were suddenly in the hands of every Excel buyer.\n\nRequests started coming in. We sold many copies. Financially it wasn’t massive, but something more valuable happened: **reputation**.\n\nMultex Quote created an impression that Multex was bigger than it really was—a product company, not just a consulting shop. And that impression traveled faster than the product itself.\n\n---\n\n## Market data vendors circle: Reuters, Telerate, ADP\n\nThat buzz reached the big market data vendors—companies whose entire business depended on quote distribution and terminals.\n\nBefore long we were in serious conversations with the major players of the time: **Telerate, Reuters, and ADP Brokerage**. They saw Multex Quote not as a clever Excel add-on, but as a wedge—a way to push their data deeper into the day-to-day workflows of analysts and advisors.\n\nEventually, **ADP** offered to acquire Multex.\n\nAnd that brought me back to Mody.\n\nMody and I went to ADP’s office to negotiate terms.\n\n---\n\nIf you want, I can do either of these next:\n\n1) **Turn the last line into a strong scene** (you and Mody walking into ADP, the vibe, the power imbalance, the negotiation tension, what you wanted vs. what they wanted).  \n2) **Create a cleaner chapter structure** (with headings and transitions so this reads like a memoir chapter rather than notes).  \n\nWhich direction fits your “Multex” tone better—more memoir/reflective, or more fast-paced/scene-driven?",
          "file_id": null,
          "url": null,
          "caption": null
        }
      ],
      "detected_languages": [],
      "created_at": "2026-02-25T17:54:53.192568+00:00",
      "updated_at": "2026-02-25T17:59:49.346413+00:00"
    },
    {
      "id": "08919fa3-a2ce-4147-add7-ddad35b9fd27",
      "story_id": "06ec1b89-b1fe-4fca-8d27-4c97621dd838",
      "name": "Предыстория, K&S Software. Создание многоязычного программного обеспечения",
      "order": 0,
      "content_blocks": [
        {
          "type": "text",
          "content": "### Глава — 1981: Первый ПК (Финал)\n\nЯ приехал в Соединённые Штаты в мае 1980 года. К тому времени я работал в Golding Industries — на моей второй работе в Америке — занимаясь разработкой ПО для текстильной производственной компании. Компьютером, внутри которого я жил каждый день, был мейнфрейм IBM под CICS — онлайн-системой обработки транзакций, которая в реальном времени обеспечивала всё, что делал бизнес.\n\nОдна задача особенно мне запомнилась.\n\nУ Golding был производственный завод в Южной Каролине, и им нужно было печатать там счета — удалённо — без того, чтобы кто-то вручную возился с лентами или бумагой в Нью-Йорке. Сегодня это звучит обыденно. Тогда — нет. Система по-настоящему не «поддерживала» программирование удалённого принтера так, как вы бы ожидали. Поэтому я сделал то, что делали в те времена: опустился до самого металла. Я написал утилиту на уровне машинного кода — и заставил её работать.\n\nЯ гордился этим. Но я также не мог забыть, насколько это было трудно — сделать такую базовую вещь: отправить слова на бумагу.\n\nЕщё до того, как я уехал из СССР, я, слушая «Голос Америки», слышал слухи о новом виде технологии: *персональные компьютеры.* Достаточно маленькие, чтобы стоять на столе. Достаточно доступные — якобы — чтобы человек мог иметь такой дома. Эта мысль засела у меня в голове, как заноза: настоящий компьютер, который принадлежит тебе.\n\nК осени 1981 года мы с женой работали уже почти год. По американским меркам мы зарабатывали немного, но у нас появилось то, чего раньше не было: стабильность. Мы жили в съёмной квартире в Бруклине, почти без мебели — только самое необходимое. Но по сравнению с тем, что мы оставили позади, это ощущалось как свобода.\n\nИ вот тогда я вспомнил своё обещание самому себе: я куплю ПК.\n\nПопулярными машинами тогда были Apple II и TRS-80. IBM объявила о своём PC, но никто ещё не знал, что он станет *тем самым* стандартом. Я всё равно выбрал его. Я каждый день работал на системах IBM и верил — почти инстинктивно — в притяжение IBM. Если уж я собирался купить компьютер на свои деньги, это должен был быть IBM PC.\n\nПроблема была в цене.\n\nУ моей системы было 64KB памяти. Для хранения — два флоппи-дисковода по 320KB каждый. И матричный принтер, который — если я правильно помню — печатал примерно 10 символов в секунду. По сегодняшним меркам это почти комично. Mac, на котором я пишу эту историю, имеет 32GB памяти — 32 000 000 000 байт против 64 000.\n\nНо в 1981 году это был полноценный компьютер. Программируемая машина. Мир.\n\nСтоимость была больше $5,000 в розничном магазине IBM, когда они открылись в Нью-Йорке — больше $14,000 в сегодняшних деньгах. Моя годовая зарплата была около $24,000. Я был в стране едва ли год. У нас не было реальных сбережений. И всё же я был решителен.\n\nПоэтому я пошёл в банк за персональным кредитом.\n\nМне сказали «нет» — по крайней мере, без поручителя. Моя кредитная история была слишком короткой. Если кто-то с сильной кредитной историей подпишется вместе со мной, они это сделают.\n\nЯ попросил человека по имени Mody Zeidman.\n\nMody жил по соседству. Он волонтёрил преподавателем английского в нашей синагоге. Он был юристом — коренным ньюйоркцем — со всем тем, чего у меня ещё не было: долгой историей в этой стране, устойчивой репутацией и той уверенностью, которая приходит вместе с ощущением принадлежности. Тогда я до конца не понимал, о чём прошу. В моей голове это была просто бумажная формальность.\n\nВ Америке это было доверием.\n\nMody согласился без колебаний.\n\nС подписью Mody банк выдал мне кредит на $6,000. Я пошёл в магазин IBM и принёс домой свой компьютер. Я до сих пор помню, как ставил его на единственный стол, который у нас был.\n\n(Есть фотография того дня. Я почти голый, потому что было лето, жарко, и у нас ещё не было кондиционера. Но у нас был компьютер.)\n\nКогда всё было подключено и включено, я начал изучать машину так, как всегда изучал машины: разбирая её кодом.\n\nСофт был примитивным. Не было даже нормального текстового редактора — только построчный. Редактируешь по одной строке за раз. Для программирования у тебя был BASIC и, если ты смелый, ассемблер для Intel 8088.\n\nЯ решил, что моим первым проектом будет полноэкранный текстовый редактор, похожий на тот, которым я пользовался на мейнфрейме IBM на работе.\n\nЭто оказалось сложнее, чем я ожидал. Но, создавая его, я понял кое-что, что позже стало сердцем всего: если я контролирую экран и раскладку клавиатуры, мне не обязательно ограничиваться английским. С некоторой изобретательностью я мог заставить его писать по-русски — или на любом алфавите, который я понимаю. И я мог сделать так, чтобы он писал не только слева направо, но и справа налево.\n\nМой лучший друг, Гера Гинзбург, тогда жил в Израиле. Он уехал из СССР почти на год раньше меня. Когда я рассказал ему, что строю, он сразу сказал: «Сделай поддержку иврита. Пусть пишет справа налево».\n\nОн был прав. И как только идея была произнесена вслух, назад пути уже не было.\n\nЯ подключил Геру в Израиле и Игоря Саксонова в Бруклине — человека, с которым меня познакомили, — и мы втроём работали по ночам. Мы продолжали толкать редактор дальше, пока он не превратился во что-то большее: многоязычный текстовый процессор.\n\nВ течение года у нас был продукт, который для раннего рынка IBM PC казался необычным.\n\nИ тут мы столкнулись с новой проблемой.\n\nМы его построили.\n\nНо мы абсолютно не знали, что с ним делать. В СССР мы не знали, как начинать бизнес. В Америке мы собирались узнать — быстро.\n\n---\n\n### Ранние дни маркетинга PC-продукта\n\nКак только у нас появился многоязычный текстовый процессор, который действительно работал, мы сразу упёрлись в проблему, не имеющую никакого отношения к программированию.\n\nМы не знали, как его продавать.\n\nИз нас троих Игорь был самым предпринимательским. У него не было «сети» в американском смысле слова — ни у кого из нас не было, — но у него были инициатива и своего рода бесстрашное любопытство. Он начал звонить людям, задавать вопросы, превращать небольшие знакомства во встречи. Друзья друзей. Знакомые по району. Кто угодно, кто мог знать кого-то, у кого есть компьютерный магазин, или бизнесмена, который «в компьютерах».\n\nТак мы начали знакомиться с ранним миром ПК в Бруклине — маленькие магазины на первых этажах, тесные задние офисы, люди, которые учились бизнесу по ходу дела. Мы приносили дискеты, проводили демонстрации, слишком много говорили и внимательно слушали. Иногда нас воспринимали всерьёз. Иногда — нет. Иногда мы были уверены, что находимся в середине настоящего делового разговора, а потом понимали, что говорим на разных языках — не на русском и английском, а на «инженерном» и «продажном».\n\nЧерез эту скудную цепочку знакомств мы в конце концов вышли на братьев Want и их магазин в центре Бруклина. В те дни компьютерный магазин не был глянцевым шоурумом — он больше напоминал мастерскую с кассой. Коробки до потолка, машины в разных стадиях сборки, где-то на фоне тарахтят принтеры, покупатели задают базовые вопросы, которые сегодня показались бы невероятными. Братья Want были практичными людьми. Они понимали клиентов. Они понимали, что продаётся. И они сразу поняли, что то, что было у нас — особенно умение работать с несколькими алфавитами и справа-налево, — это не просто технический трюк. Для правильного покупателя это был рынок.\n\nОдно знакомство вело к другому. Не вдаваясь в некоторые подробности, которые задним числом кажутся почти комичными, мы наткнулись на человека, который решил построить вокруг нашего продукта софтверную компанию.\n\nОн не был программистом. Он даже не был из мира ПК. Он был опытным бизнесменом — трейдером сырьевыми товарами, — который увидел возможность раньше, чем понял механику. И ему предстояло на собственном опыте узнать, что раннее PC-ПО — это не как commodities. Нельзя относиться к нему как к вещи, которую купил и продал и ожидаешь, что она будет вести себя сама. Ей нужна инженерия. Ей нужна поддержка. Ей нужны постоянные улучшения.\n\nНо в одном ключевом отношении он был серьёзен: он хотел купить продукт целиком.\n\n---\n\n### Продажа продукта — «Lock, Stock and Barrel»\n\nК тому времени Mody Zeidman стал для меня больше, чем человеком, который подписался поручителем по моему банковскому кредиту. Он был единственным американцем в нашей орбите, кто мог переводить нам этот новый мир: контракты, рычаги влияния, переговоры, тихую силу простого знания того, как здесь делается бизнес.\n\nMody помог нам вести переговоры и представлял нас в процессе, который оказался удивительно запутанным и затяжным. Были условия, оговорки, черновики, правки и такого рода «туда-сюда», которое ощущается меньше как логика и больше как выносливость — особенно когда ты новичок в стране и ещё учишься читать между строк.\n\nВ конце концов мы согласились на сделку, которая и сейчас кажется нереальной, когда я произношу её вслух.\n\nПокупатель создал компанию специально под наш продукт и купил его — и все права на него — *lock, stock and barrel* за **$600,000**.\n\nТолько благодаря помощи Mody мы получили, как я считаю, очень сильную цену для того времени. Мы подписали бумаги и ушли от своего детища, несколько ошеломлённые величиной суммы. Для трёх недавних эмигрантов, начавших с нуля, это ощущалось не просто как бизнес-сделка. Это было доказательством того, что мы можем построить что-то ценное в Америке.\n\nЧтобы замкнуть историю с текстовым процессором: новая компания и продукт получили название **World Master**. Похоже, в итоге компания вышла на биржу — подозреваю, на рынке AIM, но не уверен. То, что я точно знаю: она так и не достигла того прогресса, которого могла бы, потому что у неё не было инженерной поддержки. Человек, который купил продукт, не привлёк нас продолжать разработку. Без людей, которые понимали код, продукт не мог развиваться так, как требовал рынок. Со временем компания закрылась.\n\nТак что наш первый продукт не стал долгосрочным коммерческим успехом.\n\nНо для нас лично он изменил всё.\n\nМы были равноправными партнёрами, и каждый из нас ушёл с **$200,000**. К тому времени был **январь 1986 года** — в сегодняшней стоимости это было бы больше **$560,000** на каждого. Значимая сумма по любым меркам. Для трёх недавних эмигрантов это казалось огромным.\n\nМы чувствовали себя богатыми. И в СССР мы не знали, как начинать бизнес. В Америке мы собирались узнать — быстро."
        }
      ],
      "created_at": "2026-02-25T21:49:02.393926+00:00",
      "updated_at": "2026-02-25T21:49:02.393926+00:00",
      "source_chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8"
    },
    {
      "id": "ee7548d0-5070-44c9-a94e-77cdaefcd26f",
      "story_id": "06ec1b89-b1fe-4fca-8d27-4c97621dd838",
      "name": "Multex I, Goldman Sachs и стимул для Multex I",
      "order": 1,
      "content_blocks": [
        {
          "type": "text",
          "content": "Вот более сжатая, более повествовательная версия вашего раздела «Multex I / импульс со стороны Goldman Sachs», с сохранением вашего голоса, но с улучшенными плавностью, ясностью и ставками. Я также слегка поправил имена/грамматику (вы можете вернуть любые детали так, как помните).\n\n---\n\n## Multex I — Goldman Sachs и импульс\n\nНочи принадлежали моему текстовому процессору. Дни принадлежали корпоративной Америке.\n\nДаже после Golding Industries я оставался на «траектории дневной работы», но что-то изменилось. Создание того текстового процессора перепрошило мой мозг. Я не просто узнавал, как работает софт, — я узнавал, как работает возможность. И по мере того как ПК начинали просачиваться в серьёзные корпоративные среды, меня тянуло в группы передовых технологий: команды внутри больших компаний, чья задача была понять, что делать с этой новой, хаотичной штукой под названием персональный компьютер.\n\nК январю 1986 года я был в Goldman Sachs в IT, курируя R&D-группу, сосредоточенную на внедрении ПК по всей фирме. Goldman не был местом для экспериментов «просто так». Всё должно было оправдывать себя. Но именно это и делало работу захватывающей: мы пытались взять инструмент, созданный для отдельных людей, и заставить его стать корпоративным — безопасным, поддерживаемым, масштабируемым и полезным людям, для которых важны скорость и цифры.\n\nГде-то посреди всего этого мысль о том, что я могу начать собственный софтверный бизнес, перестала казаться фантазией. Она начала казаться неизбежностью.\n\nВозможность пришла через знакомый голос из прошлого.\n\nМоя бывшая начальница из Equitable Insurance — Долорес Бейли — вышла на связь. Она перешла на роль руководителя корпоративного R&D, сосредоточенного на внедрении и реализации новых технологий по всей Equitable, и спросила, могу ли я помочь в качестве консультанта.\n\nЯ сразу сказал «да». Не только потому, что это звучало интересно, но потому, что я понял, чем это было на самом деле: дверью.\n\nКонсалтинг означал, что я могу делать то, что уже умею, — строить, — и получать за это деньги, не спрашивая ни у кого разрешения. Это был самый чистый мост между «корпоративным сотрудником» и «предпринимателем», какой я только мог себе представить.\n\n---\n\n## Основание Multex Systems (Multex I) и первые клиенты\n\nВ апреле 1986 года я ушёл из Goldman и начал консультировать R&D-группу Долорес в Equitable. Работа быстро росла — настолько, что делать её в одиночку уже не имело смысла. Я привлёк трёх бывших коллег из Goldman: Джона Махоуни, Джорджа Бэрда и Вана Негриса.\n\nВместе мы основали Multex Systems.\n\nЯ был партнёром-основателем и мажоритарным акционером, но компания с первого дня строилась как настоящая командная история. Мы сразу же начали выполнять для Equitable несколько проектов — практические работы по ПК и ранней разработке под Windows, которые крупные организации хотели, но у них ещё не было внутренних сил выполнять это стабильно.\n\nЯ также дал Моди долю в Multex Systems. Тогда это было отчасти в знак благодарности за его роль в продаже текстового процессора, но оказалось, что это нечто большее. Моди умел думать о «стратегии выхода» ещё до того, как большинство людей вообще признавали, что выходы существуют. Когда время пришло снова, такой образ мыслей оказался важен.\n\nИ, пожалуй, это лучший момент, чтобы объяснить название: **Multex**.\n\nГоды назад, когда мы придумывали имя для текстового процессора, кто-то предложил сокращение от «multilingual text» — *mul-tex*. Тогда мы его не использовали, но оно засело у меня в голове — как бренд, который ждёт свой продукт. Когда пришло время называть компанию, я достал его с полки.\n\nMultex Systems — Multex I — в первую очередь была консалтинговой фирмой: проекты кастомной разработки для сред ПК и Windows. Нашими первыми крупными клиентами были Equitable и Goldman — оба бывшие работодатели, — где друзья и коллеги втягивали нас обратно под конкретные проекты.\n\nКомпания постепенно выросла примерно до 30 сотрудников, в основном разработчиков, работавших на разных клиентских задачах. Но параллельно с консалтинговой выручкой происходило ещё кое-что: мы накапливали переиспользуемую экспертизу — внутренние инструменты, библиотеки, паттерны и «шорткаты», которые делали нас быстрее с каждым месяцем.\n\nСами того до конца не понимая, мы понемногу двигались в сторону продукта.\n\nОдна из таких внутренних инициатив превратилась в небольшой продукт, который мы назвали **Multex Quote**.\n\n---\n\n## Microsoft, Excel и рождение Multex Quote\n\nMultex Quote начался почти случайно — потому что Microsoft нужна была история.\n\nMicrosoft готовила крупный анонс нового продукта под названием **Excel**, и в Нью-Йорке они планировали поставить разные «темы», показывающие, как Excel можно использовать в реальном бизнесе. Одна из тем называлась **Wall Street**.\n\nНо чтобы «Wall Street» выглядел по-настоящему, Excel нужно было то, чего «из коробки» у него не было: живые рыночные данные.\n\nMicrosoft нужна была рабочая демонстрация — быстро — а разработчиков, которые понимали и Excel, и финансовые данные в реальном времени, было немного. Каким-то образом всплыло наше имя, и нам позвонили: можем ли мы сделать быстрое приложение, которое будет закачивать котировки в Excel в реальном времени и создавать впечатление, что Excel способен вести портфель в режиме реального времени?\n\nДжон и Джордж отработали всю ночь. Это был абсолютный прототип — наколеночный, слепленный на скорую руку, не то, что вы бы отгрузили клиенту, — но он работал. Он подавал живые цены в Excel, и модели в таблицах обновлялись в реальном времени.\n\nНа большом мониторе это выглядело как будущее.\n\n---\n\n## Анонс Excel и момент, когда зал подался вперёд\n\nПостановка была театральной: большой зал, оформленный как «Wall Street», ПК с Excel на большом экране, цены тикают вживую — на нашем ночном прототипе.\n\nТоп-менеджеры финансовых фирм проходили мимо и останавливались, их притягивало движение данных в реальном времени и подразумеваемая за ним мысль: *если это работает, мы можем построить на этом что угодно.*\n\nОдним из тех, кто остановился, был представитель Fidelity Investments: **Jim Stoddard**, отвечавший за разработку технологий для сети консультантов Fidelity. Он не воспринимал это как трюк. Он смотрел на это как на механизм дистрибуции.\n\nОн задал простой вопрос: *Как я могу купить это для своих пользователей?*\n\nМы честно объяснили: это всего лишь прототип, и чтобы сделать его достаточно надёжным для реального использования, нужна серьёзная разработка.\n\nДжим предложил нам сделку, от которой мы не могли отказаться.\n\nFidelity профинансирует разработку. В обмен консультанты Fidelity смогут пользоваться этим бесплатно. И, что критично, после завершения **права на продукт останутся у нас**.\n\nЭто был редкий тип корпоративного соглашения: крупный институт платит за превращение прототипа в продукт — и при этом оставляет небольшой компании весь апсайд.\n\nМы согласились.\n\nПримерно за шесть месяцев мы сделали настоящий рабочий продукт: систему, которая связывала рыночные котировки с моделями Excel в реальном времени, давая пользователям возможность строить и запускать портфельную аналитику прямо внутри электронной таблицы.\n\n---\n\n## Коммерческая дистрибуция через Microsoft\n\nПотом нам снова повезло.\n\nКто-то в Microsoft — вероятно, тот же человек, что изначально связался с нами, — услышал, во что превратился профинансированный Fidelity прототип. Microsoft предложила нам промо-возможность, которую маленькая фирма не смогла бы купить напрямую.\n\nМы напечатали брошюры для Multex Quote, объясняющие, как он подаёт котировки в Excel с использованием технологии обмена данными в реальном времени от Microsoft под названием **DDE**. Мы отправили пачки брошюр на производственную площадку Microsoft. Microsoft вложила по одной в каждую коробку Excel, отправляемую покупателям.\n\nЗа цену печати мы внезапно оказались в руках каждого покупателя Excel.\n\nНачали приходить запросы. Мы продали много копий. Финансово это было не гигантско, но случилось кое-что более ценное: **репутация**.\n\nMultex Quote создал впечатление, что Multex больше, чем он был на самом деле, — продуктовая компания, а не просто консалтинговая лавка. И это впечатление распространялось быстрее, чем сам продукт.\n\n---\n\n## Вендоры рыночных данных идут по кругу: Reuters, Telerate, ADP\n\nЭтот шум дошёл до больших поставщиков рыночных данных — компаний, весь бизнес которых держался на распространении котировок и терминалах.\n\nВскоре мы вели серьёзные разговоры с крупнейшими игроками того времени: **Telerate, Reuters и ADP Brokerage**. Они видели в Multex Quote не хитрую надстройку над Excel, а клин — способ протолкнуть свои данные глубже в повседневные рабочие процессы аналитиков и консультантов.\n\nВ конце концов **ADP** предложила купить Multex.\n\nИ это вернуло меня к Моди.\n\nМы с Моди поехали в офис ADP, чтобы обсуждать условия.\n\n---\n\nЕсли хотите, дальше я могу сделать одно из двух:\n\n1) **Превратить последнюю строку в сильную сцену** (как вы с Моди заходите в ADP, атмосфера, дисбаланс сил, напряжение переговоров, чего хотели вы и чего хотели они).  \n2) **Создать более чистую структуру главы** (с заголовками и переходами, чтобы это читалось как глава мемуаров, а не как заметки).  \n\nКакое направление лучше подходит тону вашего «Multex» — более мемуарное/рефлексивное или более быстрое/сценическое?"
        }
      ],
      "created_at": "2026-02-25T21:49:02.393926+00:00",
      "updated_at": "2026-02-25T21:49:02.393926+00:00",
      "source_chapter_id": "4afc2093-d155-4771-86bb-43695788bcd1"
    }
  ],
  "story_messages": [
    {
      "id": "3624bacc-94d1-448d-a7a0-0a93bc8ab000",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "user",
      "content": "The Multex story starts sometime in 1981. I came to this country in May of 1980 and at that time was working for Golding Industries, my second job in the US. I oversaw a small computing system for Golding. Mostly I was doing software development for this textile manufacturing company, but also was responsible for the operation of the system. It was an IBM mainframe computer running an online system called CICS. The reason I am mentioning it, is because it’s relevant to how I got interested in PCs.  CICS - Customer Information Control System is a family of mixed language application servers that provide online transaction management and connectivity for applications on IBM Mainframe systems under z/OS and z/VSE. Wikipedia While developing the system, I had to create a utility to remotely print invoices at the manufacturing plant that operated in South Carolina. It was a pretty challenging task as at that time the system didn’t support direct programing of a remote printer and the utility had to be programed at a machine code level. I managed to finish the job successfully but the difficulty of doing it stuck in my mind. Even when I was still in Russia while listening to voice of America, I heard about a new technology development Personal Computers. According to the story they were so small and affordable that a person was able to buy it for personal use. This got me very fascinated, and I knew that once I settle a bit in America, I will investigate it.  By fall of 1981 both my wife and I were working for close to a year as software developers and, although we were earning low salaries by US standards, but nevertheless, given our reasonably modest expectations, we thought that we are pretty stable financially. We lived in a rented apartment in Brooklyn with a minimal amount of furniture, just the necessities, but compared to the conditions at that time in the former USSR, we were quite happy with our lifestyle.  That’s when I remembered about my dream of owning a personal computer and started to investigate what’s available in the market. The most popular systems at that time were Apple II and TRS-80. Although IBM PC was already announced it wasn’t clear that it’ll be the market leader it eventually became. But because I was working on an IBM system and was a big believer in IBMs dominance in the computing market (as it was at that time) I have decided that my personal computer should be an IBM PC. I think that it was the most expensive PC at that time, but I had my heart set on it and I’ve started to think where and how will I get the money to get a fully configured system. Just for the fun of it I’ll list the system configuration of my first PC. It had a 64KB of internal memory (the MAC I am using to write this story has 32GB of internal memory, 32,000,000,000 vs 64,000). For permanent/external storage the PC had two floppy disk drives 320KB each. It also had a dot matrix printer. If I remember correctly its output was 10 characters per second.   Even though by today’s standards this is quite a pathetic system, at that time it was very reasonable, and most importantly, it was programable and a full-blown computing system with all the attributes of a real computer.  It wasn’t cheap either. A system configured as above cost over $5,000 at an IBM retail store when they opened them in New York. In today’s money it would be over $14,000. But I was determent to get one and was looking for a way to raise the funds. It was a lot of money for me at the time. My annual salary I think was $24,000. So, it was almost a quarter of my pre-tax annual earnings. And given that we were working for just a year, starting from a complete scratch, that was a lot of money. We didn’t have any meaningful savings, so I started to look into getting a personal loan from a bank.  Obviously since I was such a short time in the country and employed for just a year I had a very limited credit history and the bank wouldn’t give me a loan. But they said that if I found a guarantor with a good credit history, they would give me a loan, assuming he would co-sign the application. I had a friend who lived in our neighborhood and was a volunteer English teacher in our local synagogue, Mody Zeidman. He was a lawyer and a native New Yorker. So obviously his credit line was good. At that point I didn’t live in the country long enough to understand that I am asking for a very material commitment and trust. But Mody agreed without any hesitation. Through this transaction he really became my partner in a few ventures, including Multex, that I have started a few years later. With Mody’s guaranty on my personal loan application I got a $6,000 loan from the bank. And happily, proceeded to the IBM store to pick up my new computer. Here’s the picture of me in our Brooklyn apartment, at the only table we had, getting things figured out with my new computer.     I am semi naked because it’s summer and hot, and we don’t yet have an air conditioner, but do have a computer . Once I got the system home and set it up I started to learn its architecture and how to program it. Software wise it was quite limited. It didn’t even have a text processor that would let you edit a whole page, but only had a line editor. You had to edit a line at a time when you wrote your program. For programming it had only Basic and of course Assembler for Intel’s 8088 processor.  I’ve decided, as my first project, to write a full-page text editor, similar to the one I was used to on the IBM mainframe that I was using at work. It turned out to be a pretty challenging project. While doing it I realized that with some creativity I can make the program write not only in English, but also in Russian (and any other language that I would know the alphabet of) and make it write not only left to right but also right to left.  At that time my best friend Gera Ginzburg lived in Israel. He left USSR almost a year ahead of me. So, when I talked to him over the phone, I was excitedly telling him about the PC and the project I was working on. Gera was also a software engineer and right away suggested that I should make my text editor support Hebrew alphabet and make it write right to left. I agreed and expanded my project to support Hebrew.  As the project grew, I engaged two of my friends Gera in Israel and Igor Saxonov, who somebody introduced me to and who lived not far from me in Brooklyn, to help me work on the project and to turn my text editor into a word processor.  Without going into a lot of details I’ll just say that within a year, while working at nights, the three of us eventually developed the product into a multilingual word processor. So now we had a product that at that time was somewhat unique given how small the software market for IBM PC was. But what can we do with it and how we can “commercialize” it the three of us, being recent emigrants from a “communist” country, had not a clue.",
      "created_at": "2026-02-25T17:38:48.092218+00:00"
    },
    {
      "id": "39b9fd54-0e4c-403f-aca9-7e2b9f7d6b8f",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "assistant",
      "content": "This is a strong opening for “Multex” because it does three important jobs at once: it anchors you in a specific moment in tech history (CICS/mainframe era turning into PC era), it introduces the *personal* stakes (immigrant finances, modest Brooklyn life, the sheer audacity of a $5,000 machine), and it plants the seed of the core differentiator that later becomes Multex: multilingual/right-to-left computing.\n\nBelow are narrative improvements and a suggested rewrite approach that keeps your voice but tightens pacing, increases scene-ness, and tees up commercialization as a cliffhanger.\n\n---\n\n## What’s already working (keep it)\n- **The machine-code remote printer story** is a perfect “why PCs mattered to me” hook: it shows you were hands-on, inventive, and frustrated by big-iron limitations.\n- **The $5,000 PC math vs modern Mac memory** is a great perspective shift. Keep it.\n- **Mody co-signing** is gold: it’s character, community, and foreshadowing for partnership later.\n- **The multilingual/right-to-left discovery** is the true “Multex DNA moment.” That should be treated like a small revelation scene, not just an aside.\n\n---\n\n## Suggested structural tightening (same content, better momentum)\nConsider breaking this section into 6 short “beats” with mini-cliffhangers:\n\n1. **Mainframe mastery + friction** (CICS, remote invoice printing, machine code hack)\n2. **The dream arrives** (Voice of America, PCs as a promise)\n3. **Brooklyn stability** (immigrant life, modest apartment, “we felt rich in a different way”)\n4. **Choosing IBM PC** (belief in IBM, the cost, the gamble)\n5. **Mody** (the loan obstacle, cultural misunderstanding, his instant trust)\n6. **The product spark** (building the editor → multilingual → Hebrew/right-to-left → team forms → “Now what?”)\n\nThis keeps the reader moving and makes each segment feel like a step toward Multex rather than a general memoir passage.\n\n---\n\n## Places to add vivid “story” detail (quick wins)\nYou don’t need a lot—just a few sensory anchors:\n\n- **IBM Store moment**: what did the store look like, how did it feel to hand over the paperwork, what was in the boxes, how heavy were they?\n- **Brooklyn apartment**: one sharp detail (the single table, fan in the window, the sound of the dot-matrix printer at night).\n- **The first successful Hebrew/right-to-left test**: describe the moment the letters finally flowed properly. That’s your “inventor’s spark.”\n\n---\n\n## Small language/clarity edits you may want\n- “programing” → **programming**\n- “determent” → **determined**\n- “guaranty” → **guarantee** (or “guarantor”; both fine, just be consistent)\n- When you define CICS, you can either:\n  - keep the Wikipedia-style definition but format it as a footnote/aside, or\n  - replace it with a simpler line in your voice: *“CICS was the kind of system where thousands of transactions lived—and nothing was simple if it wasn’t designed for it.”*\n\n---\n\n## A suggested rewrite (same events, more narrative drive)\nUse this as a draft you can steal from, trim, or reshape:\n\n### 1981 — The first PC\n\nI came to the United States in May of 1980. By then I was working at Golding Industries—my second job in America—doing software development for a textile manufacturing company. The computer I lived inside every day was an IBM mainframe running CICS, an online transaction system that handled everything the business did in real time.\n\nOne task in particular stayed with me.\n\nGolding had a manufacturing plant in South Carolina, and they needed invoices printed there—remotely—without someone manually handling tapes or paper in New York. Today that sounds ordinary. Back then it wasn’t. The system didn’t really “support” programming a remote printer the way you’d expect. So I did what you did in those days: I went down to the metal. I wrote a utility at the machine-code level and made it work.\n\nI was proud of it. But I also couldn’t forget how hard it had been just to do something so basic—send words to paper.\n\nEven before I left the USSR, I’d heard rumors of a new kind of technology while listening to Voice of America: *personal computers.* Small enough to sit on a desk. Affordable enough—supposedly—that a person could own one. The idea lodged in my head like a splinter: a real computer that belonged to you.\n\nBy the fall of 1981 my wife and I had been working for close to a year. We weren’t making much by American standards, but we had something we hadn’t had before: stability. We lived in a rented apartment in Brooklyn with almost no furniture—just necessities. But compared to what we’d left behind, it felt like freedom.\n\nAnd that’s when I remembered my promise to myself: I was going to get a PC.\n\nThe popular machines then were the Apple II and the TRS-80. IBM had announced its PC, but nobody yet knew it would become *the* standard. I chose it anyway. I was working on IBM systems every day, and I believed—almost instinctively—in IBM’s gravity. If I was going to buy a computer with my own money, it had to be an IBM PC.\n\nThe problem was the price.\n\nMy system had 64KB of memory. For storage it had two floppy drives, 320KB each. And a dot-matrix printer that—if I remember correctly—printed at about 10 characters per second. By today’s standards it’s almost comical. The Mac I’m writing this story on has 32GB of memory—32,000,000,000 bytes compared to 64,000.\n\nBut in 1981 it was a full-blown computer. A programmable machine. A world.\n\nThe cost was over $5,000 at the IBM retail store when they opened in New York—over $14,000 in today’s money. My annual salary was around $24,000. I had been in the country barely a year. We had no real savings. Still, I was determined.\n\nSo I went to a bank for a personal loan.\n\nThey said no—at least, not without a guarantor. My credit history was too short. If someone with strong credit co-signed, they would do it.\n\nI asked a man named Mody Zeidman.\n\nMody lived in our neighborhood. He volunteered as an English teacher at our synagogue. He was a lawyer—a native New Yorker—with everything I didn’t yet have: a long history in this country, a stable reputation, and the kind of confidence that comes with belonging. At the time I didn’t fully understand what I was asking. In my mind it was just paperwork.\n\nIn America, it was trust.\n\nMody agreed without hesitation.\n\nWith Mody’s signature, the bank gave me a $6,000 loan. I went to the IBM store and brought home my computer. I still remember setting it up on the only table we owned.\n\n(There’s a photo from that day. I’m half naked because it was summer, hot, and we didn’t have an air conditioner yet. But we had a computer.)\n\nOnce everything was connected and powered up, I started to learn the machine the way I always learned machines: by taking it apart with code.\n\nThe software was primitive. There wasn’t even a real text editor—just a line editor. You edited one line at a time. For programming you had BASIC and, if you were brave, assembler for Intel’s 8088.\n\nI decided my first project would be a full-screen text editor, like the one I used on the IBM mainframe at work.\n\nIt was harder than I expected. But while building it I realized something that would later become the heart of everything: if I controlled the screen and the keyboard mapping, I didn’t have to stop at English. With some creativity, I could make it write in Russian—or any alphabet I understood. And I could make it go not only left to right, but right to left.\n\nMy best friend, Gera Ginzburg, was living in Israel then. He had left the USSR almost a year before me. When I told him what I was building, he immediately said: “Make it support Hebrew. Make it write right to left.”\n\nHe was right. And once the idea was spoken out loud, there was no going back.\n\nI brought in Gera in Israel and Igor Saxonov in Brooklyn—someone I’d been introduced to—and the three of us worked nights. We kept pushing the editor until it became something bigger: a multilingual word processor.\n\nWithin a year, we had a product that felt unusual for the early IBM PC market.\n\nAnd then we hit a new problem.\n\nWe had built it.\n\nBut we had absolutely no idea what to do with it.\n\n---\n\n## Two options for the ending line (choose based on tone)\nIf you want it reflective:\n- *“We had escaped one system where everything was planned. Now we were in the opposite world—and we didn’t know the first thing about selling.”*\n\nIf you want it punchier:\n- *“In the USSR we didn’t know how to start a business. In America, we were about to find out—fast.”*\n\n---\n\nIf you want, paste the next section you’re planning (the first attempt to sell it, forming K&S Software, first ads/distribution, etc.), and I’ll help you shape the commercialization arc so it builds tension: first tiny wins, first humiliations, first unexpected mentor, first real check.",
      "created_at": "2026-02-25T17:39:34.377578+00:00"
    },
    {
      "id": "e33c9797-9301-45dc-9e11-ba0b44d28c8c",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "user",
      "content": "I like your changes, and the second of your suggestion, puncher, please add it and keep your edited version",
      "created_at": "2026-02-25T17:46:43.872425+00:00"
    },
    {
      "id": "a9de9911-9f44-4b01-9b66-d01af219f88e",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "assistant",
      "content": "### 1981 — The first PC\n\nI came to the United States in May of 1980. By then I was working at Golding Industries—my second job in America—doing software development for a textile manufacturing company. The computer I lived inside every day was an IBM mainframe running CICS, an online transaction system that handled everything the business did in real time.\n\nOne task in particular stayed with me.\n\nGolding had a manufacturing plant in South Carolina, and they needed invoices printed there—remotely—without someone manually handling tapes or paper in New York. Today that sounds ordinary. Back then it wasn’t. The system didn’t really “support” programming a remote printer the way you’d expect. So I did what you did in those days: I went down to the metal. I wrote a utility at the machine-code level and made it work.\n\nI was proud of it. But I also couldn’t forget how hard it had been just to do something so basic—send words to paper.\n\nEven before I left the USSR, I’d heard rumors of a new kind of technology while listening to Voice of America: *personal computers.* Small enough to sit on a desk. Affordable enough—supposedly—that a person could own one. The idea lodged in my head like a splinter: a real computer that belonged to you.\n\nBy the fall of 1981 my wife and I had been working for close to a year. We weren’t making much by American standards, but we had something we hadn’t had before: stability. We lived in a rented apartment in Brooklyn with almost no furniture—just necessities. But compared to what we’d left behind, it felt like freedom.\n\nAnd that’s when I remembered my promise to myself: I was going to get a PC.\n\nThe popular machines then were the Apple II and the TRS-80. IBM had announced its PC, but nobody yet knew it would become *the* standard. I chose it anyway. I was working on IBM systems every day, and I believed—almost instinctively—in IBM’s gravity. If I was going to buy a computer with my own money, it had to be an IBM PC.\n\nThe problem was the price.\n\nMy system had 64KB of memory. For storage it had two floppy drives, 320KB each. And a dot-matrix printer that—if I remember correctly—printed at about 10 characters per second. By today’s standards it’s almost comical. The Mac I’m writing this story on has 32GB of memory—32,000,000,000 bytes compared to 64,000.\n\nBut in 1981 it was a full-blown computer. A programmable machine. A world.\n\nThe cost was over $5,000 at the IBM retail store when they opened in New York—over $14,000 in today’s money. My annual salary was around $24,000. I had been in the country barely a year. We had no real savings. Still, I was determined.\n\nSo I went to a bank for a personal loan.\n\nThey said no—at least, not without a guarantor. My credit history was too short. If someone with strong credit co-signed, they would do it.\n\nI asked a man named Mody Zeidman.\n\nMody lived in our neighborhood. He volunteered as an English teacher at our synagogue. He was a lawyer—a native New Yorker—with everything I didn’t yet have: a long history in this country, a stable reputation, and the kind of confidence that comes with belonging. At the time I didn’t fully understand what I was asking. In my mind it was just paperwork.\n\nIn America, it was trust.\n\nMody agreed without hesitation.\n\nWith Mody’s signature, the bank gave me a $6,000 loan. I went to the IBM store and brought home my computer. I still remember setting it up on the only table we owned.\n\n(There’s a photo from that day. I’m half naked because it was summer, hot, and we didn’t have an air conditioner yet. But we had a computer.)\n\nOnce everything was connected and powered up, I started to learn the machine the way I always learned machines: by taking it apart with code.\n\nThe software was primitive. There wasn’t even a real text editor—just a line editor. You edited one line at a time. For programming you had BASIC and, if you were brave, assembler for Intel’s 8088.\n\nI decided my first project would be a full-screen text editor, like the one I used on the IBM mainframe at work.\n\nIt was harder than I expected. But while building it I realized something that would later become the heart of everything: if I controlled the screen and the keyboard mapping, I didn’t have to stop at English. With some creativity, I could make it write in Russian—or any alphabet I understood. And I could make it go not only left to right, but right to left.\n\nMy best friend, Gera Ginzburg, was living in Israel then. He had left the USSR almost a year before me. When I told him what I was building, he immediately said: “Make it support Hebrew. Make it write right to left.”\n\nHe was right. And once the idea was spoken out loud, there was no going back.\n\nI brought in Gera in Israel and Igor Saxonov in Brooklyn—someone I’d been introduced to—and the three of us worked nights. We kept pushing the editor until it became something bigger: a multilingual word processor.\n\nWithin a year, we had a product that felt unusual for the early IBM PC market.\n\nAnd then we hit a new problem.\n\nWe had built it.\n\nBut we had absolutely no idea what to do with it. In the USSR we didn’t know how to start a business. In America, we were about to find out—fast.",
      "created_at": "2026-02-25T17:46:57.212941+00:00"
    },
    {
      "id": "612108af-b772-4409-a71d-6b29c86dc299",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "user",
      "content": "here is concluding parts of this chapter:",
      "created_at": "2026-02-25T17:47:59.900600+00:00"
    },
    {
      "id": "451bd9fb-6da0-4b97-9650-a06048d14336",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "assistant",
      "content": "Paste the concluding parts here (text or bullets—whatever you have).\n\nAlso tell me what you want me to do with it:\n1) light edit for clarity/grammar only,  \n2) full rewrite to match the tone of the edited chapter above, or  \n3) restructure + rewrite (tighten pacing, add scene, sharpen ending).",
      "created_at": "2026-02-25T17:48:02.012930+00:00"
    },
    {
      "id": "e060cc5b-f245-4bd5-bb27-1f454f6b38b3",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "user",
      "content": "option 3, i'll follow with the paste",
      "created_at": "2026-02-25T17:49:17.133557+00:00"
    },
    {
      "id": "309ce3ef-7900-44df-bb4b-2fa8e26563cf",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "assistant",
      "content": "Got it—option 3 (restructure + rewrite).\n\nPaste the concluding text when ready. If you have any of these details, include them too (even as quick notes), because they’ll help me turn it into a strong ending beat for the chapter:\n\n- What was the product called at this stage?\n- Did you make any demo disks/manuals yet?\n- First attempt to sell: who/where (computer store, synagogue community, mail order, ad)?\n- Any “first rejection” or funny misunderstanding in the American business world?\n- Where does the chapter end—decision to form K&S Software, or first sale, or first marketing step?\n\nSend what you have and I’ll shape it to match the narrative flow of the edited section.",
      "created_at": "2026-02-25T17:49:21.270352+00:00"
    },
    {
      "id": "f8510bea-b17c-49a2-baa4-c49ece3d752a",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "user",
      "content": "2.\tEarly days of marketing a PC product  It turned out that the most entrepreneurial of us was Igor. He started to reach out through his meager network to friends and acquaintances.  (expand, include the story of Want brothers, their store in downtown Brooklyn, etc.) Without going into sometime hilarious details, we eventually stumbled into a guy who decided that he will make a software company based on our product. It turned out that even though he was a sophisticated businessman (commodities trader) he was quite naïve at the very young business of PC software.  3.\tSell to a company that used the Word Processor to IPO  My friend Mody Zeidman helped a lot in negotiating and representing us in the convoluted and relatively protracted negotiation process, but eventually we agreed on the terms and price. Only because of Mody’s help we got a pretty substantial for that time price for our product. It was $600,000 for the sale of the product and all of the rights to it “lock, stock and barrel” to the company this guy formed specifically for this product.  We walked away from our creation to some degree shocked by the amount of money we got. Just to close the story on the word processor. The new company and the product were named “World Master”. Apparently, it IPO-d (I suspect on the AIM market, but don’t know for sure). It didn’t manage to make a lot of progress as it didn’t have any software engineering support. The guy bought the product from, but didn’t engage us to continue to develop it. The company has eventually folded and so our first product didn’t turn into a great commercial success, but the three of us made a fair amount of money (we were equal partners in our little venture). Each walked away with $200,000. By that time, it was already Jan of 1986 and in today’s value it would be over $560,000. Meaningful amount, but for the three recent emigrants it seemed like a lot of money. We felt rich .",
      "created_at": "2026-02-25T17:49:29.951286+00:00"
    },
    {
      "id": "24ef36b8-3bf4-45e6-b9b2-bba944879b9b",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "assistant",
      "content": "### Early days of marketing a PC product\n\nOnce we had a multilingual word processor that actually worked, we ran straight into a problem that had nothing to do with software.\n\nWe didn’t know how to sell it.\n\nOf the three of us, Igor was the most entrepreneurial. He didn’t have a “network” in the American sense of the word—none of us did—but he had initiative and a kind of fearless curiosity. He started calling people, asking questions, turning small connections into meetings. Friends of friends. Acquaintances from the neighborhood. Anyone who might know someone who owned a computer store or knew a businessman who was “in computers.”\n\nThat’s how we began to get introduced to the early PC world in Brooklyn—small storefronts, cramped back offices, people learning the business as they went along. We’d bring disks, do demonstrations, talk too much, and listen carefully. Sometimes we were taken seriously. Sometimes we weren’t. Sometimes we were sure we were in the middle of a real business conversation, only to realize later that we were speaking different languages—not Russian and English, but “engineering” and “sales.”\n\nThrough this meager chain of introductions, we eventually found our way to the Want brothers and their store in downtown Brooklyn. In those days, a computer store wasn’t a sleek showroom—it was more like a workshop with a cash register. Boxes stacked to the ceiling, machines in various states of assembly, printers chattering in the background, customers asking basic questions that today would seem unbelievable. The Want brothers were practical people. They understood customers. They understood what sold. And they understood immediately that what we had—especially the ability to handle multiple alphabets, and right-to-left—wasn’t just a technical trick. For the right buyer, it was a market.\n\nOne introduction led to another. Without going into some details that were, in hindsight, almost hilarious, we stumbled into a man who decided he would build a software company around our product.\n\nHe wasn’t a programmer. He wasn’t even from the PC world. He was a sophisticated businessman—a commodities trader—who saw the opportunity before he understood the mechanics. And he was about to learn, the hard way, that early PC software wasn’t like commodities. You couldn’t treat it as a thing you bought and sold and expected to behave by itself. It needed engineering. It needed support. It needed constant improvement.\n\nBut in one crucial respect, he was serious: he wanted to buy the product outright.\n\n### Selling the product—“lock, stock and barrel”\n\nBy then, Mody Zeidman had become more than the man who co-signed my bank loan. He was the one American in our orbit who could translate this new world for us: contracts, leverage, negotiation, the quiet power of simply knowing how business is done here.\n\nMody helped us negotiate and represented us through what became a surprisingly convoluted, protracted process. There were terms, conditions, drafts, revisions, and the kind of back-and-forth that feels less like logic and more like endurance—especially when you’re new to the country and still learning how to read between the lines.\n\nIn the end we agreed on a deal that, even now, still feels unreal when I say it out loud.\n\nThe buyer formed a company specifically for our product and purchased it—and all rights to it—*lock, stock and barrel* for **$600,000**.\n\nOnly because of Mody’s help did we get what I believe was a very strong price for that time. We signed the papers and walked away from our creation somewhat stunned by the size of the number. For three recent emigrants who had started from scratch, it didn’t just feel like a business transaction. It felt like proof that we could build something valuable in America.\n\nTo close the loop on the word processor: the new company and product were named **World Master**. Apparently, it eventually went public—I suspect on the AIM market, but I’m not sure. What I do know is that it never made the progress it could have, because it didn’t have software engineering support. The man who bought it didn’t engage us to keep developing it. Without the people who understood the code, the product couldn’t evolve the way the market demanded. In time, the company folded.\n\nSo our first product didn’t become a long-term commercial success.\n\nBut for us personally, it changed everything.\n\nWe were equal partners, and each of us walked away with **$200,000**. By then it was **January 1986**—in today’s value, that would be over **$560,000** each. A meaningful amount of money by any standard. For three recent emigrants, it felt enormous.\n\nWe felt rich. And in the USSR we didn’t know how to start a business. In America, we were about to find out—fast.\n\n---\n\nIf you want, I can also:\n- weave in one or two specific “hilarious details” without derailing the seriousness (a miscommunication, a ridiculous store encounter, a naïve pitch moment), and/or\n- add one paragraph that explicitly transitions from this sale into the next chapter: how the money changed your confidence, what it enabled (time, equipment, risk-taking), and why it set the stage for K&S Software and eventually Multex.",
      "created_at": "2026-02-25T17:49:55.415947+00:00"
    },
    {
      "id": "e8f9091a-09fd-4d35-b377-0161b28e8fc4",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "user",
      "content": "this is good so far, I'll create and paste the next chapter. I cover some of the things you suggest there",
      "created_at": "2026-02-25T17:52:55.074508+00:00"
    },
    {
      "id": "ef63b154-75ea-4c90-8575-a805ed50f453",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "assistant",
      "content": "Whenever you’re ready, paste the next chapter and I’ll do the same option-3 treatment (restructure + rewrite) to keep the voice consistent and the momentum building.\n\nTo make the transition between chapters feel intentional (and not just “next thing happened”), include—if it fits naturally—one or two of these in your draft, even as rough notes:\n\n- What the $200k *changed immediately* (apartment, moving, equipment, time, confidence, relationships)\n- What you *thought* you would do next vs what actually happened\n- Whether the World Master sale felt like an ending, a detour, or the true beginning\n\nSend it when ready.",
      "created_at": "2026-02-25T17:52:59.349772+00:00"
    },
    {
      "id": "99e716f4-1e21-451b-944c-a7f2ededadca",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "4afc2093-d155-4771-86bb-43695788bcd1",
      "role": "user",
      "content": "While I was working nights on my word processor, during the day I continued to work regular day jobs in the corporate America. After Golding Industries, I had two more jobs, but with my new knowledge of PCs I was now working in companies advanced technology groups responsible for figuring out how PCs could be used in the corporate IT. In Jan of 1986 I was working at Goldman Sachs IT and oversaw a l group called R&D department with the focus on the PC implementation throughout Goldman. I guess the whole experience of the word processor woke up in me an entrepreneur and now I was thinking about my own software business. The opportunity came when my old boss at a company I worked for before Goldman Sachs, called Equitable Insurance, got in touch with me and told me that she is now in charge of the corporate R&D focusing on new technology adoption and implementation at Equitable. She asked me if I can help in a consulting capacity and I gladly agreed, as I saw this as an opportunity to start my own business.  2.\tFounding and early clients  I left Goldman in April of 1986 and started as a consultant working in my friend’s Dolores Bailey R&D department at Equitable. The project grew, and I invited three of my former colleagues from Goldman to join. We formed a new company called Multex Systems where I was the founding partner with majority shareholding, but joined by John Mahoney, George Baird, and Van Negris. All four of us started to work on several projects for Dolores at Equitable. In appreciation of Mody’s role in the sale of word processor I also gave him some equity in Multex Systems. It turned out that his role in negotiating an “exit strategy” for my business was very important again when the time came. This is probably a good time to explain why the name Multex. The name came from the idea of the word processor. At some point when we were thinking about the name for our product someone suggested that multilingual text could be abbreviated to mul-tex. We didn’t use the name then, but it stuck with me and when the time came to name my new business I decided to call it Multex. Multex Systems (Multex I) was mostly a consulting business focusing on development projects for the PC and Windows environment. The main clients were Equitable and Goldman, my former employers, where friends and colleagues invited us back to do specific projects related to PC/Windows development. Gradually the company grew to around 30 employees, software developers that worked on different projects. But along the way, while doing development for clients we have developed substantial expertise and some tools that enabled us to also build some product capability. One of this was a small product we named Multex Quote.  3.\tMicrosoft and the idea of Multex Quote  It originated when Microsoft was planning a big announcement of their new product called Excel. They were planning the announcement in one of the hotels in New York with multiple business themes for Excel use. One of the themes was “Wall Street”. But they needed an app functionality that would demonstrate the potential use of Excel on Wall Street. Since the market for app developers working with Wall Street firms was relatively small and since Multex Systems was one of these developers, someone at Microsoft heard about us and asked us to quickly develop an app that would work in combination with Excel and pump real-time quotes into Excel in such a way that Excel would be able to demonstrate “Real-time Portfolio” functionality.  I remember a whole nighter that John and George had to pull to develop this functionality. Obviously, it was a hacked together quick prototype, but it worked for what Microsoft requited and looked very impressive on a large screen monitor that Microsoft provided. 4.\tMicrosoft announcement of Excel and massive interest in real-time link to Excel  So here we were in a large room set up as “Wall Street” with a PC set up with a large monitor running Excel with real-time prices fed into it by Multex Quote. The product that was built over night by John and George . It looked very impressive and several executives from Wall Street firms came over to see. One of these was a person from Fidelity Investments. Fidelity had a large network of advisors and this guy, Jim Stoddard, oversaw technology development for the advisors. Jim liked the product and asked how he can buy it for his users. We explain that this is only a prototype and to make it into a robust product it would require a substantial development. Then Jim offered us a deal we couldn’t refuse. He said that Fidelity will pay for this development and once it’s fully functional he would let us have the rights for the product assuming we will let the Fidelity advisors to be able to use it at no cost. It was obviously a great deal and we agreed. The development with Fidelity lasted I think about six month or so, and as a result we had a real product that worked in combination with Excel providing real-time quotes into Excel developed models. 5.\tCommercial version of Multex Quote and marketing and distribution through Microsoft  And now we got the another break. Someone at Microsoft, probably the same person that originally got in touch with us, have heard about our new product and made us another great offer. We would need to print a large number of brochures describing Multex Quote and explaining how it feeds quotes into Excel using a Microsoft developed real-time data interchange called DDE. We would need to ship these brochures to Microsoft production facility and they would insert a copy of our brochure into each package of Excel shipped to clients. It was a great deal because for a relatively low cost of producing the brochures we got a free promotion of our product to all of Excel users.   Through this marketing we started to get requests from clients for the Multex Quote and sold, I believe, a large number of copies. Financially it wasn’t very material, but the word spread out and, as it often happens, the impression we created with Multex Quote was much bigger than it was in reality.  6.\tMarket Data vendors interested in Multex Quote, Proposals from all major vendors.  The buzz around it attracted a lot of interest from most of the big Market Data companies of the time. Before too long we were negotiating partnerships or distribution rights with Telerate, Reuters and ADP Brokerage. Eventually ADP offered to acquire Multex. And Mody and I went to their office to negotiate terms.",
      "created_at": "2026-02-25T17:57:04.502718+00:00"
    },
    {
      "id": "500b4d43-56a7-4d7e-a6b0-cae9c907c140",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "4afc2093-d155-4771-86bb-43695788bcd1",
      "role": "assistant",
      "content": "Here’s a tightened, more narrative version of your “Multex I / Goldman Sachs impetus” section, keeping your voice but improving flow, clarity, and stakes. I’ve also lightly corrected names/grammar (you can revert any detail to match your memory).\n\n---\n\n## Multex I — Goldman Sachs and the impetus\n\nNights belonged to my word processor. Days belonged to corporate America.\n\nEven after Golding Industries, I stayed on the “day job” track, but something had changed. Building that word processor had rewired my brain. I wasn’t just learning how software worked—I was learning how opportunity worked. And as PCs started creeping into serious corporate environments, I found myself pulled into advanced technology groups: the teams inside big companies whose job was to figure out what to do with this new, chaotic thing called the personal computer.\n\nBy January of 1986 I was at Goldman Sachs in IT, overseeing an R&D group focused on PC implementation across the firm. Goldman wasn’t a place that experimented casually. Everything had to justify itself. But that was exactly what made it exciting: we were trying to take a tool that had been designed for individuals and force it to become something corporate—secure, supportable, scalable, and useful to people who cared about speed and numbers.\n\nSomewhere in the middle of all that, the idea that I might start my own software business stopped feeling like a fantasy. It started feeling like an inevitability.\n\nThe opportunity arrived through a familiar voice from my past.\n\nMy old boss from Equitable Insurance—Dolores Bailey—reached out. She had moved into a role leading corporate R&D, focused on adopting and implementing new technology across Equitable, and she asked if I could help in a consulting capacity.\n\nI said yes immediately. Not just because it sounded interesting, but because I recognized what it really was: a door.\n\nConsulting meant I could do what I already knew how to do—build—and get paid for it, without asking anyone’s permission. It was the cleanest bridge between “corporate employee” and “entrepreneur” that I could imagine.\n\n---\n\n## Founding Multex Systems (Multex I) and early clients\n\nIn April of 1986, I left Goldman and began consulting with Dolores’s R&D group at Equitable. The work grew quickly—enough that it didn’t make sense to do it alone. I brought in three former Goldman colleagues: John Mahoney, George Baird, and Van Negris.\n\nTogether, we formed Multex Systems.\n\nI was the founding partner and majority shareholder, but the company was built as a true team effort from day one. We immediately started delivering multiple projects for Equitable—practical PC and early Windows development work that big organizations wanted, but didn’t yet have the internal muscle to execute consistently.\n\nI also gave Mody equity in Multex Systems. At the time it was partly appreciation for his role in the word processor sale, but it turned out to be more than that. Mody had a way of thinking about “exit strategy” before most people even admitted exits existed. When the time came again, that mindset proved important.\n\nAnd this is probably the best moment to explain the name: **Multex**.\n\nYears earlier, while naming the word processor, someone had tossed out an abbreviation for “multilingual text”—*mul-tex*. We never used it then, but it stuck in my head like a brand waiting for its product. When it came time to name the company, I pulled it off the shelf.\n\nMultex Systems—Multex I—was primarily a consulting firm: custom development projects for PC and Windows environments. Our first major clients were Equitable and Goldman—both former employers—where friends and colleagues pulled us back in for specific projects.\n\nThe company gradually grew to around 30 employees, mostly developers working across different client engagements. But something else was happening alongside the consulting revenue: we were accumulating reusable expertise—internal tools, libraries, patterns, and shortcuts that made us faster every month.\n\nWithout fully realizing it at the time, we were inching toward product.\n\nOne of those internal efforts became a small product we called **Multex Quote**.\n\n---\n\n## Microsoft, Excel, and the birth of Multex Quote\n\nMultex Quote started almost accidentally—because Microsoft needed a story.\n\nMicrosoft was preparing a major announcement of a new product called **Excel**, and in New York they planned to stage different “themes” showing how Excel could be used in real businesses. One of the themes was **Wall Street**.\n\nBut for “Wall Street” to look real, Excel needed something it didn’t have out of the box: live market data.\n\nMicrosoft needed a working demonstration—fast—and the number of developers who understood both Excel and real-time financial data was small. Somehow our name came up, and we got the call: could we build a quick app that pumped real-time quotes into Excel and made it look like Excel could run a real-time portfolio?\n\nJohn and George pulled a full all-nighter. It was absolutely a prototype—hacked together, rushed, not something you’d ship to a client—but it worked. It fed live prices into Excel, and the spreadsheet models updated in real time.\n\nOn a large monitor, it looked like the future.\n\n---\n\n## The Excel announcement and the moment the room leaned in\n\nThe setup was theatrical: a large room staged as “Wall Street,” a PC running Excel on a big screen, with prices ticking live—powered by our overnight prototype.\n\nExecutives from financial firms wandered over, drawn in by the motion of real-time data and the implication behind it: *if this works, we can build anything on top of it.*\n\nOne of the people who stopped was from Fidelity Investments: **Jim Stoddard**, who oversaw technology development for Fidelity’s advisor network. He didn’t admire it as a gimmick. He looked at it as a distribution mechanism.\n\nHe asked a simple question: *How can I buy this for my users?*\n\nWe explained the truth—this was only a prototype, and to make it robust enough for real use would require serious development.\n\nJim offered us a deal we couldn’t refuse.\n\nFidelity would fund the development. In exchange, Fidelity advisors would be allowed to use it at no cost. And crucially, once it was complete, **we would retain the rights** to the product.\n\nIt was a rare kind of corporate agreement: a major institution paying to turn a prototype into a product—while letting the small company keep the upside.\n\nWe agreed.\n\nOver roughly six months we built a real, working product: a system that linked market quotes into Excel models in real time, giving users a way to build and run portfolio analytics directly inside a spreadsheet.\n\n---\n\n## Commercial distribution through Microsoft\n\nThen we got another break.\n\nSomeone at Microsoft—likely the same person who’d originally contacted us—heard what the Fidelity-funded prototype had become. Microsoft offered us a promotional opportunity that would have been impossible for a small firm to buy outright.\n\nWe printed brochures for Multex Quote explaining how it fed quotes into Excel using Microsoft’s real-time data interchange technology called **DDE**. We shipped stacks of brochures to Microsoft’s production facility. Microsoft inserted one into every Excel package shipped to customers.\n\nFor the cost of printing, we were suddenly in the hands of every Excel buyer.\n\nRequests started coming in. We sold many copies. Financially it wasn’t massive, but something more valuable happened: **reputation**.\n\nMultex Quote created an impression that Multex was bigger than it really was—a product company, not just a consulting shop. And that impression traveled faster than the product itself.\n\n---\n\n## Market data vendors circle: Reuters, Telerate, ADP\n\nThat buzz reached the big market data vendors—companies whose entire business depended on quote distribution and terminals.\n\nBefore long we were in serious conversations with the major players of the time: **Telerate, Reuters, and ADP Brokerage**. They saw Multex Quote not as a clever Excel add-on, but as a wedge—a way to push their data deeper into the day-to-day workflows of analysts and advisors.\n\nEventually, **ADP** offered to acquire Multex.\n\nAnd that brought me back to Mody.\n\nMody and I went to ADP’s office to negotiate terms.\n\n---\n\nIf you want, I can do either of these next:\n\n1) **Turn the last line into a strong scene** (you and Mody walking into ADP, the vibe, the power imbalance, the negotiation tension, what you wanted vs. what they wanted).  \n2) **Create a cleaner chapter structure** (with headings and transitions so this reads like a memoir chapter rather than notes).  \n\nWhich direction fits your “Multex” tone better—more memoir/reflective, or more fast-paced/scene-driven?",
      "created_at": "2026-02-25T17:57:42.782750+00:00"
    },
    {
      "id": "7aa55245-1c20-4d72-8cc5-512675697fb6",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "4afc2093-d155-4771-86bb-43695788bcd1",
      "role": "user",
      "content": "7.\tSell of Multex One to ADP  It was a pretty funny discussion. The gist of it was the following. Mody and I met at the ADP Brokerage offices with Bob Casale and Ralf Koehrer. Bob was the president of the Brokerage division; Ralph ran the front office division in Bob’s organization and was specifically interested to acquire Multex Quote for reasons I’ll explain later. We sat across from each other, Bob and Ralph on one side of a long table and Mody and I on the other. After an introductory small talk Bob asked us how much we want for the company. Mody and I looked at each other and Mody said that we would like to have a private chat before we answer the question. Bob and Ralph left the room.  Again, we looked at each other and Mody asked me what I think. Frankly I had not a clue. I didn’t know how to value a business, realistically this was my first experience in a situation like this, since the sale of K&S was a very different case where we had a product with no revenue, while in this case there actually was a business, with revenue at around $3 million a year, but mostly all of it was from consulting revenue with a really negligible amount coming from sales of Multex Quote. Yet ADP was interested in the product and the team, but not the consulting part. Now days this type of acquisition is called acquihire and is mostly intended for the purpose of hiring a good team of developers with a promising product idea and maybe an early version of the product. It happens quite often and might be very beneficial to an incumbent company when it needs to enter/compete in a new field.  I thought that since we are really selling the product and since realistically it’s a somewhat small product getting a $1 million for it would be great. I underappreciated the fact that the team itself was valuable to ADP, as it turned out much more valuable than the product itself. Frankly Mody also didn’t understand any of these, but he had the right instincts. He looked at me, when I suggested a price of $1 million and said, let’s ask for $7.5 million. I thought that he’s crazy and that ADP will laugh us out of the room. It turned out I was very wrong and if anything, we probably asked too little. When Bob and Ralph came back and Mody announce the price we came up with, Bob right away said, fine. They agreed to this price, but they would like to have it structured as $3.5 million upfront plus $4 million over four years based on certain deliverables. Again a very typical deal structure in an acquihire situation.   We were so shocked that they agreed that we basically did not negotiate on the rest of the terms and agreed to all their conditions about the deliverables. To us even the $3.5 million upfront was way more than we expected. Since it was an acquihire of the Multex team, by today’s standards ADP didn’t pay too much, if anything it was on the low end. But in these days, it wasn’t such a common practice as it is now, and it was a good deal for both sides.  8.\tBuilding of ADP brokerage workstation  The reason ADP Brokerage needed our team is because ADP had a product for the brokerage clients called FS Partner which provided real-time quotes, news and some other front office applications for the brokers of financial institutions. This product was competing with similar products of other vendors, like Reuters, Telerate, Quotron and some others. To demonstrate technical superiority ADP wanted to have their product run on PCs in a common operating system. But the PC DOS available then didn’t have multitasking/multiwindow support required to run multiple applications needed to support the functionality the workstation required. So, ADP decided to build their product using an operating system called Mondrian.  Mondrian was developed based on IBM’s Top-View. IBM’s attempt to compete with the brand-new Microsoft Windows. The product flapped and was later given to Microsoft by IBM, but never officially release by Microsoft either. Nevertheless, ADP Brokerage used it to develop its version of multitasking PC-based market data workstation. At the point they acquired Multex it became obvious that Mondrian is a dead-end and that they need to support an operating system that the marked would accept. Windows was very young, and it wasn’t clear that it’s going to make it either. Specifically, because IBM has announced that they are working on a “real” multitasking/multiwindow operating system called OS/2. And ADP (as many corporate clients and technology pundits at that point) believed that IBM will obviously win, and OS/2 will dominate.  So, ADP in the contract they concludeed with us specified a number of deliverables that we had to develop over the next four year to be paid the rest of the purchase price, the remaining $4 millions, in two or three installments. Essentially, we had to develop, based on our Multex Quote experience a new FS Partner but now on OS/2.  George Baird was the lead developer, and the team has developed the OS/2 version of FS Partner on time and with style. The only problem was that OS/2 didn’t make it into the main league and at the time the product was ready nobody from ADP clients wanted it. Nevertheless we got paid the first installment.  Bob Casale was instrumental in this and overall, Bob behaved as a gentleman relative to making sure we got paid even though the product they got wasn’t wat the clients wanted. But on our side, I also wanted to make sure that ADP would get their money worth in developing a product that the market needed and not only what the letter of the contract required. And we engaged in porting the product we developed to both MS Windows and UNIX. We successfully accomplished this task as well and eventually ADP had a product that ran on any of the operating systems the clients wanted. MS Windows, UNIX X-Windows, and even OS/2.   9.\tCommercial success of FS-Partner  The flexibility of the product we built, and specifically the ability of FS Partner to run on MS Windows and UNIX X-Windows made FS Partner a leader in the brokerage community. And by the end of our four-year terms of our contract with ADP, FS Partner had about 70% of the market of the brokerage workstations in US. So, it was a great success, and we got the rest of our payments. By this time, I was a Senior VP working directly for Bob and was looking for the next challenge career wise and professionally. Bob was trying to give me this challenge, but for multiple reasons that isn’t interesting to discuss here, it wasn’t happening within ADP. This is probably a good time to introduce Jim Tousignant and his role at Multex. Jim was the first salesman we hired at Multex Systems. Probably around the second year of operations. He was very young with very little sales experience, but he was a natural salesman. He was very helpful in the relationship with Microsoft and was very helpful in setting up discussions with market data vendors. After the acquisition by ADP Jim became one of ADP’s sales executives. One of Jim’s accounts was Merrill Lynch. I think it was actually ADP’s biggest brokerage account with around 15K workstations of FS Partner installed. So obviously they had a lot of influence on the relationship and ADP listened to their suggestions and wishes.  10.\tIdea of electronic research distribution product  One day Jim came to me with an idea that Merrill has proposed to ADP. Obviously, at that time in 1989, way before the widespread adoption of Internet, all wide area communications was done using proprietary networks and were quite expensive. To deliver real-time market data ADP has maintained a network that connected its data centers and the client’s locations. Merrill Lynch was one of these clients and understood very well the value of this network. They were thinking how to increase the value of the network and at the same time lower the cost of delivering information services to their internal and external clients.  One of these services was financial research that their research departments were producing in very large quantities. This research, known in the industry as “Wall Street Research” was produced by their financial analysts who analyze public companies’ performance, as well as financial markets and other financial instruments. At that point the result of this research would be a printed brochure, often in colors and sometimes reaching many pages of printed materials.  The cost of printing and mailing these research documents was very substantial, reaching tens of millions of dollars per year for a large firm like Merrill, that had hundreds of analysts generating research on thousands of companies, that had to be delivered to hundreds of institutional clients. A few people in Merrill’s research department operations approached this problem creatively and thought that given ADP’s network reach the research documents can be delivered to their clients’ destinations electronically. They discussed this idea with Jim, their ADP representative, with this proposal and Jim got very excited with this opportunity. He came to me to discuss the technical visibility of such an approach. I thought about it and decided that although it’s feasible to do technically, it’s not a very exciting project. Jim disagreed, and we kicked the idea back and force for a while.",
      "created_at": "2026-02-25T17:59:57.470063+00:00"
    },
    {
      "id": "83e18d0b-1511-46af-b5e2-aad4d69bd3e9",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "4afc2093-d155-4771-86bb-43695788bcd1",
      "role": "assistant",
      "content": "## 7. Sale of Multex I to ADP\n\nThe meeting at ADP Brokerage felt formal in the way big-company meetings always do—too much table, too much distance, too much quiet. Mody and I were led into a conference room at ADP’s offices and sat down across from **Bob Casale** and **Ralf Koehrer**.\n\nBob was the president of the Brokerage division. Ralf ran the front-office group inside Bob’s organization, and he had a very specific interest in us—really, in **Multex Quote**—for reasons that would become clear later.\n\nThey did the usual introductory small talk. Then Bob got to the point.\n\n“So,” he said, as if he were asking about the weather, “how much do you want for the company?”\n\nMody and I looked at each other. I remember thinking: *This is it. This is the moment where you’re supposed to know what you’re doing.*\n\nInstead, Mody said, politely, “We’d like a few minutes to discuss privately before we answer.”\n\nBob and Ralf stepped out, leaving us alone in that oversized room.\n\nThe silence after the door shut was its own kind of pressure.\n\nMody turned to me. “What do you think?”\n\nFrankly, I had no idea. This was my first real acquisition conversation. The sale of the word processor business had been a completely different situation—a product, no real revenue, more potential than proof. **Multex**, on the other hand, was an actual operating company. We had around **$3 million a year in revenue**, but it was mostly consulting. **Multex Quote**—the product ADP cared about—was still a small sliver of that.\n\nLooking back, what ADP was doing would be called an *acquihire*: buying a company primarily for its team and its trajectory, not its current P&L. That kind of deal is common now. Back then it wasn’t a standard playbook, at least not in the way people talked about it.\n\nIn my head, I was pricing a modest add-on product, not a team with momentum.\n\n“If we could get a million dollars for it,” I said, “that would be great.”\n\nMody stared at me for a beat—long enough for me to feel my own inexperience hanging in the air. Then he said, calmly:\n\n“Let’s ask for **seven and a half million**.”\n\nI thought he was out of his mind. I pictured Bob and Ralf coming back in, laughing politely, and escorting us out like two kids who’d wandered into the wrong building.\n\nBut Mody had something I didn’t have yet: instinct. Not perfect knowledge—instinct. He understood that when a big company wants something badly enough to call you into their office, *your value is already higher than you think*.\n\nWhen Bob and Ralf returned, Mody gave them the number.\n\n“Seven point five.”\n\nBob didn’t blink.\n\n“Fine,” he said.\n\nThat was it. No outrage. No lecture. No counter at half. Just *fine*—as if he’d already decided before we walked in what it was worth to him.\n\nThey did, however, want to structure the deal: **$3.5 million up front**, plus **$4 million** over the next four years tied to deliverables—exactly the kind of structure that makes sense when you’re buying a team and a direction, not just a product.\n\nWe were so stunned they agreed to the price that we barely negotiated the rest. We accepted their deliverables and their terms almost as-is, because even the upfront amount was far beyond what we’d expected.\n\nBy today’s standards, ADP didn’t overpay for an acquihire. If anything, it was on the low end. But at the time, these deals weren’t routine—and for us, it was a major outcome. It was also, in a strange way, the moment I finally understood Mody’s real value: not what he knew, but the way he thought about leverage, outcomes, and exits before most of us had the vocabulary for any of it.\n\n---\n\n## 8. Building the ADP Brokerage workstation (FS Partner)\n\nADP’s urgency wasn’t about consulting revenue. They didn’t need another consulting firm. They needed a **product team**.\n\nADP Brokerage already had a market data workstation called **FS Partner**. It delivered real-time quotes, news, and front-office functionality to brokers at major financial institutions. The space was competitive—Reuters, Telerate, Quotron, and others—and the differentiation came down to performance, reliability, and the ability to run a modern, multi-application desktop.\n\nThat was the problem: the PC operating systems available at the time weren’t really built for what ADP wanted. **MS-DOS** didn’t have true multitasking and windowing. A workstation needed multiple things running at once—quotes, news, messaging, maybe charting—and the desktop had to behave like a *platform*.\n\nADP had made an unusual choice: they built their workstation on an operating system called **Mondrian**, based on IBM’s **TopView**—IBM’s early attempt to compete with the brand-new Microsoft Windows. TopView never became a market standard. Mondrian, by extension, was clearly a dead end.\n\nWhen they acquired Multex, it became obvious that if ADP wanted to win long-term, they had to bet on an operating system the market would accept. The question was: which one?\n\nAt that moment in time, **Windows was young**, and it wasn’t obvious it would win. Meanwhile IBM was promising something that sounded far more “real” to corporate technologists: **OS/2**. Many people believed IBM would dominate the future the way it dominated the present.\n\nADP believed it too.\n\nThat belief was embedded into our acquisition contract: the deliverables tied to the remaining $4 million were essentially an obligation to build the next-generation FS Partner based on what we’d learned with Multex Quote—only now, rebuilt as a full workstation on **OS/2**.\n\n**George Baird** led the development. Our team delivered the OS/2 version on time—and we delivered it with style.\n\nThe only problem was the market.\n\nOS/2 didn’t become the standard people predicted. By the time our product was ready, ADP’s clients didn’t want it. They wanted what they believed their own customers would support—and that was increasingly **Windows**, and in many institutional environments, **UNIX/X-Windows**.\n\nTo ADP’s credit, we still got paid the first installment. **Bob Casale** was instrumental in that. He behaved like a gentleman—recognizing that we had delivered what we were asked to deliver, even if the industry had shifted underneath the plan.\n\nBut I didn’t want our relationship with ADP to be defined by “we met the contract.” I wanted ADP to get something that actually mattered in the market.\n\nSo we did what the contract didn’t explicitly require: we ported the workstation to **Microsoft Windows** and to **UNIX/X-Windows**. When we were done, ADP had a workstation product that could run on whatever operating system the client wanted: Windows, UNIX, and yes—OS/2.\n\n---\n\n## 9. Commercial success of FS Partner\n\nThat flexibility changed everything.\n\nFS Partner became a leader in the brokerage workstation community, and by the end of our four-year term, it had captured roughly **70% of the U.S. brokerage workstation market**. We collected the remaining payments.\n\nBy then I was a **Senior VP**, working directly for Bob. On paper, I was exactly where someone with my background was “supposed” to land: senior role, major product, market share, momentum.\n\nBut personally, I was starting to look for the next challenge—something that felt like *creation*, not continuation.\n\nBob tried to give me that challenge inside ADP. For a variety of reasons (not worth detouring into here), it didn’t quite happen.\n\nAnd that’s the point where it makes sense to introduce **Jim Tousignant**.\n\nJim had been the first salesperson we hired at Multex Systems—probably around our second year. He was young and didn’t have much formal sales experience, but he was a natural. He’d been crucial in our Microsoft relationship and in getting us into conversations with the market data vendors.\n\nAfter ADP acquired Multex, Jim became one of ADP’s sales executives. One of his biggest accounts was **Merrill Lynch**—likely ADP Brokerage’s largest customer—with something like **15,000 FS Partner workstations** installed.\n\nWhen Merrill spoke, ADP listened.\n\n---\n\n## 10. The idea that didn’t sound exciting (yet): electronic research distribution\n\nOne day Jim came to me with a proposal Merrill had floated to ADP.\n\nThis was around 1989—long before the internet became a default distribution channel. Wide-area communications were done through **proprietary networks**, and they were expensive. ADP had built and maintained a network connecting its data centers to client locations in order to deliver real-time market data. Merrill was deeply aware of how valuable that network was.\n\nMerrill wanted to increase the network’s value—and at the same time reduce the cost of delivering information to both internal and external clients.\n\nThey had a very specific pain point: **research**.\n\n“Wall Street Research” was produced in massive quantities by Merrill’s analysts—reports on public companies, sectors, markets, instruments. At that time, the output was typically a printed document: often long, sometimes in color, distributed constantly.\n\nPrinting and mailing these research packets cost serious money—*tens of millions of dollars a year* for a firm like Merrill. Hundreds of analysts, thousands of companies, and a distribution obligation to institutions all over the country (and beyond). It was industrial-scale paper.\n\nSome smart people in Merrill’s research operations started asking the obvious question:\n\nIf ADP already has a network reaching our sites, why can’t we distribute research electronically?\n\nThey talked to Jim—ADP’s representative—and Jim immediately saw the opportunity. He came to me to ask whether it was technically feasible.\n\nI thought about it and said yes: technically feasible, absolutely.\n\nBut I also told him the truth: it didn’t excite me. Compared to real-time quotes and workstations and all the engineering complexity we’d lived in, “electronic document delivery” sounded… tame.\n\nJim disagreed. He felt there was something bigger hiding in it.\n\nAnd for a while, we went back and forth—kicking the idea between us—without realizing we were circling the edge of the next Multex.\n\n---\n\n### Quick questions (to make the next rewrite even sharper)\n1) Do you want to name the location/city of the ADP office (or keep it generic)?  \n2) Were the deliverables explicitly **OS/2-only**, or was OS/2 just the “main” one?  \n3) When you say “UNIX,” do you remember which vendors were common at your clients then (Sun, HP, IBM AIX), or should we keep it broad?\n\nIf you want, I can turn sections 7–10 into a more *scene-driven* sequence (more dialogue, more tension, more “you are there”), while still keeping it memoir-realistic.",
      "created_at": "2026-02-25T18:00:43.969911+00:00"
    },
    {
      "id": "7402a84e-ccdb-4d24-b8e9-4eae59be84a5",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "user",
      "content": "save your changes to this chapter as final chapter",
      "created_at": "2026-02-25T18:28:29.706036+00:00"
    },
    {
      "id": "abe1e226-0d78-4d0d-a460-3d8ae934b851",
      "story_id": "3ead3c3a-4175-45b7-b0a5-3d9251b3c81c",
      "chapter_id": "11a9de61-3b5d-4d3e-817b-4e9ffe3006d8",
      "role": "assistant",
      "content": "### Chapter — 1981: The First PC (Final)\n\nI came to the United States in May of 1980. By then I was working at Golding Industries—my second job in America—doing software development for a textile manufacturing company. The computer I lived inside every day was an IBM mainframe running CICS, an online transaction system that handled everything the business did in real time.\n\nOne task in particular stayed with me.\n\nGolding had a manufacturing plant in South Carolina, and they needed invoices printed there—remotely—without someone manually handling tapes or paper in New York. Today that sounds ordinary. Back then it wasn’t. The system didn’t really “support” programming a remote printer the way you’d expect. So I did what you did in those days: I went down to the metal. I wrote a utility at the machine-code level and made it work.\n\nI was proud of it. But I also couldn’t forget how hard it had been just to do something so basic—send words to paper.\n\nEven before I left the USSR, I’d heard rumors of a new kind of technology while listening to Voice of America: *personal computers.* Small enough to sit on a desk. Affordable enough—supposedly—that a person could own one. The idea lodged in my head like a splinter: a real computer that belonged to you.\n\nBy the fall of 1981 my wife and I had been working for close to a year. We weren’t making much by American standards, but we had something we hadn’t had before: stability. We lived in a rented apartment in Brooklyn with almost no furniture—just necessities. But compared to what we’d left behind, it felt like freedom.\n\nAnd that’s when I remembered my promise to myself: I was going to get a PC.\n\nThe popular machines then were the Apple II and the TRS-80. IBM had announced its PC, but nobody yet knew it would become *the* standard. I chose it anyway. I was working on IBM systems every day, and I believed—almost instinctively—in IBM’s gravity. If I was going to buy a computer with my own money, it had to be an IBM PC.\n\nThe problem was the price.\n\nMy system had 64KB of memory. For storage it had two floppy drives, 320KB each. And a dot-matrix printer that—if I remember correctly—printed at about 10 characters per second. By today’s standards it’s almost comical. The Mac I’m writing this story on has 32GB of memory—32,000,000,000 bytes compared to 64,000.\n\nBut in 1981 it was a full-blown computer. A programmable machine. A world.\n\nThe cost was over $5,000 at the IBM retail store when they opened in New York—over $14,000 in today’s money. My annual salary was around $24,000. I had been in the country barely a year. We had no real savings. Still, I was determined.\n\nSo I went to a bank for a personal loan.\n\nThey said no—at least, not without a guarantor. My credit history was too short. If someone with strong credit co-signed, they would do it.\n\nI asked a man named Mody Zeidman.\n\nMody lived in our neighborhood. He volunteered as an English teacher at our synagogue. He was a lawyer—a native New Yorker—with everything I didn’t yet have: a long history in this country, a stable reputation, and the kind of confidence that comes with belonging. At the time I didn’t fully understand what I was asking. In my mind it was just paperwork.\n\nIn America, it was trust.\n\nMody agreed without hesitation.\n\nWith Mody’s signature, the bank gave me a $6,000 loan. I went to the IBM store and brought home my computer. I still remember setting it up on the only table we owned.\n\n(There’s a photo from that day. I’m half naked because it was summer, hot, and we didn’t have an air conditioner yet. But we had a computer.)\n\nOnce everything was connected and powered up, I started to learn the machine the way I always learned machines: by taking it apart with code.\n\nThe software was primitive. There wasn’t even a real text editor—just a line editor. You edited one line at a time. For programming you had BASIC and, if you were brave, assembler for Intel’s 8088.\n\nI decided my first project would be a full-screen text editor, like the one I used on the IBM mainframe at work.\n\nIt was harder than I expected. But while building it I realized something that would later become the heart of everything: if I controlled the screen and the keyboard mapping, I didn’t have to stop at English. With some creativity, I could make it write in Russian—or any alphabet I understood. And I could make it go not only left to right, but right to left.\n\nMy best friend, Gera Ginzburg, was living in Israel then. He had left the USSR almost a year before me. When I told him what I was building, he immediately said: “Make it support Hebrew. Make it write right to left.”\n\nHe was right. And once the idea was spoken out loud, there was no going back.\n\nI brought in Gera in Israel and Igor Saxonov in Brooklyn—someone I’d been introduced to—and the three of us worked nights. We kept pushing the editor until it became something bigger: a multilingual word processor.\n\nWithin a year, we had a product that felt unusual for the early IBM PC market.\n\nAnd then we hit a new problem.\n\nWe had built it.\n\nBut we had absolutely no idea what to do with it. In the USSR we didn’t know how to start a business. In America, we were about to find out—fast.\n\n---\n\n### Early Days of Marketing a PC Product\n\nOnce we had a multilingual word processor that actually worked, we ran straight into a problem that had nothing to do with software.\n\nWe didn’t know how to sell it.\n\nOf the three of us, Igor was the most entrepreneurial. He didn’t have a “network” in the American sense of the word—none of us did—but he had initiative and a kind of fearless curiosity. He started calling people, asking questions, turning small connections into meetings. Friends of friends. Acquaintances from the neighborhood. Anyone who might know someone who owned a computer store or knew a businessman who was “in computers.”\n\nThat’s how we began to get introduced to the early PC world in Brooklyn—small storefronts, cramped back offices, people learning the business as they went along. We’d bring disks, do demonstrations, talk too much, and listen carefully. Sometimes we were taken seriously. Sometimes we weren’t. Sometimes we were sure we were in the middle of a real business conversation, only to realize later that we were speaking different languages—not Russian and English, but “engineering” and “sales.”\n\nThrough this meager chain of introductions, we eventually found our way to the Want brothers and their store in downtown Brooklyn. In those days, a computer store wasn’t a sleek showroom—it was more like a workshop with a cash register. Boxes stacked to the ceiling, machines in various states of assembly, printers chattering in the background, customers asking basic questions that today would seem unbelievable. The Want brothers were practical people. They understood customers. They understood what sold. And they understood immediately that what we had—especially the ability to handle multiple alphabets, and right-to-left—wasn’t just a technical trick. For the right buyer, it was a market.\n\nOne introduction led to another. Without going into some details that were, in hindsight, almost hilarious, we stumbled into a man who decided he would build a software company around our product.\n\nHe wasn’t a programmer. He wasn’t even from the PC world. He was a sophisticated businessman—a commodities trader—who saw the opportunity before he understood the mechanics. And he was about to learn, the hard way, that early PC software wasn’t like commodities. You couldn’t treat it as a thing you bought and sold and expected to behave by itself. It needed engineering. It needed support. It needed constant improvement.\n\nBut in one crucial respect, he was serious: he wanted to buy the product outright.\n\n---\n\n### Selling the Product — “Lock, Stock and Barrel”\n\nBy then, Mody Zeidman had become more than the man who co-signed my bank loan. He was the one American in our orbit who could translate this new world for us: contracts, leverage, negotiation, the quiet power of simply knowing how business is done here.\n\nMody helped us negotiate and represented us through what became a surprisingly convoluted, protracted process. There were terms, conditions, drafts, revisions, and the kind of back-and-forth that feels less like logic and more like endurance—especially when you’re new to the country and still learning how to read between the lines.\n\nIn the end we agreed on a deal that, even now, still feels unreal when I say it out loud.\n\nThe buyer formed a company specifically for our product and purchased it—and all rights to it—*lock, stock and barrel* for **$600,000**.\n\nOnly because of Mody’s help did we get what I believe was a very strong price for that time. We signed the papers and walked away from our creation somewhat stunned by the size of the number. For three recent emigrants who had started from scratch, it didn’t just feel like a business transaction. It felt like proof that we could build something valuable in America.\n\nTo close the loop on the word processor: the new company and product were named **World Master**. Apparently, it eventually went public—I suspect on the AIM market, but I’m not sure. What I do know is that it never made the progress it could have, because it didn’t have software engineering support. The man who bought it didn’t engage us to keep developing it. Without the people who understood the code, the product couldn’t evolve the way the market demanded. In time, the company folded.\n\nSo our first product didn’t become a long-term commercial success.\n\nBut for us personally, it changed everything.\n\nWe were equal partners, and each of us walked away with **$200,000**. By then it was **January 1986**—in today’s value, that would be over **$560,000** each. A meaningful amount of money by any standard. For three recent emigrants, it felt enormous.\n\nWe felt rich. And in the USSR we didn’t know how to start a business. In America, we were about to find out—fast.",
      "created_at": "2026-02-25T18:28:59.667084+00:00"
    }
  ],
  "users": [
    {
      "id": "aed72783-a5a9-448b-98ba-51f027fce119",
      "email": "test@archiva.com",
      "name": "Test User",
      "created_at": "2026-02-22T19:48:33.735065+00:00"
    },
    {
      "id": "3f1b3fc0-737f-4f7f-b584-610056636da1",
      "email": "demo2@archiva.com",
      "name": "Demo User",
      "created_at": "2026-02-22T19:59:49.264210+00:00"
    },
    {
      "id": "d5e48591-0c7a-45ef-8b49-97201759bbb3",
      "email": "ikaraev@alfangen.com",
      "name": "Isaak",
      "created_at": "2026-02-22T20:16:02.923264+00:00"
    }
  ]
}